;******************************************************************************
;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
;* Date/Time created: Mon Feb 24 13:22:57 2025                                *
;******************************************************************************
	.compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:data=large --object_format=elf --silicon_errata=CPU21 --silicon_errata=CPU22 --silicon_errata=CPU40 --silicon_version=mspx --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../src/bak.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\Debug")
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("BAKMEM0")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("BAKMEM0")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("C:\ti\ccs1250\ccs\ccs_base\msp430\include\msp430fg6626.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$1, DW_AT_decl_column(0x01)

$C$DW$2	.dwtag  DW_TAG_variable
	.dwattr $C$DW$2, DW_AT_name("BAKMEM1")

	.dwpsn	file "../src/bak.c",line 263,column 5,is_stmt,isa 0
        MOV.B     r12,r15               ; [] |263| 
        RRUM.W    #2,r15                ; [] |263| 
        AND.W     #7,r15                ; [] |263| 
        TST.W     r15                   ; [] |263| 
        JEQ       $C$L54                ; [] |263| 
                                          ; [] |263| 
;* --------------------------------------------------------------------------*
        SUB.W     #1,r15                ; [] |263| 
        JEQ       $C$L53                ; [] |263| 
                                          ; [] |263| 
;* --------------------------------------------------------------------------*
        SUB.W     #1,r15                ; [] |263| 
        JEQ       $C$L52                ; [] |263| 
                                          ; [] |263| 
;* --------------------------------------------------------------------------*
        SUB.W     #1,r15                ; [] |263| 
        JEQ       $C$L51                ; [] |263| 
                                          ; [] |263| 
;* --------------------------------------------------------------------------*
        SUB.W     #1,r15                ; [] |263| 
;***	; this point in the function is never reached
	.dwpsn	file "../src/bak.c",line 289,column 9,is_stmt,isa 0
        MOV.W     #16,r15               ; [] |289| 
        JMP       $C$L55                ; [] |289| 
                                          ; [] |289| 
;* --------------------------------------------------------------------------*
	.align	4
$C$L51:    
	.dwpsn	file "../src/bak.c",line 272,column 9,is_stmt,isa 0
        MOV.W     #8,r15                ; [] |272| 
        JMP       $C$L55                ; [] |272| 
                                          ; [] |272| 
;* --------------------------------------------------------------------------*
	.align	4
$C$L52:    
	.dwpsn	file "../src/bak.c",line 270,column 9,is_stmt,isa 0
        MOV.W     #4,r15                ; [] |270| 
        JMP       $C$L55                ; [] |270| 
                                          ; [] |270| 
;* --------------------------------------------------------------------------*
	.align	4
$C$L53:    
	.dwpsn	file "../src/bak.c",line 268,column 9,is_stmt,isa 0
        MOV.W     #2,r15                ; [] |268| 
        JMP       $C$L55                ; [] |268| 
                                          ; [] |268| 
;* --------------------------------------------------------------------------*
$C$L54:    
	.dwpsn	file "../src/bak.c",line 266,column 9,is_stmt,isa 0
        MOV.W     #1,r15                ; [] |266| 
;* --------------------------------------------------------------------------*
$C$L55:    
	.dwpsn	file "../src/bak.c",line 116,column 9,is_stmt,isa 0
        MOVX.A    &CH_Channels+16,r14   ; [] |116| 
        MOV.W     r15,6(r14)            ; [] |116| 
	.dwpsn	file "../src/bak.c",line 118,column 9,is_stmt,isa 0
        MOV.B     r12,r12               ; [] |118| 
        RPT #5 || RRUX.W r12 ; [] |118| 
        MOV.W     #4,r13                ; [] |118| 
$C$DW$82	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$82, DW_AT_low_pc(0x00)
	.dwattr $C$DW$82, DW_AT_name("DecodePregain")
	.dwattr $C$DW$82, DW_AT_TI_call

        CALLA     #DecodePregain        ; [] |118| 
                                          ; [] |118| 
        MOVX.A    &CH_Channels+16,r15   ; [] |118| 
        MOV.W     r12,4(r15)            ; [] |118| 
	.dwpsn	file "../src/bak.c",line 121,column 9,is_stmt,isa 0
        MOVX.A    #MAIN_CurrentTime+0,r12 ; [] |121| 
$C$DW$83	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$83, DW_AT_low_pc(0x00)
	.dwattr $C$DW$83, DW_AT_name("CLK_GetRTC")
	.dwattr $C$DW$83, DW_AT_TI_call

        CALLA     #CLK_GetRTC           ; [] |121| 
                                          ; [] |121| 
	.dwpsn	file "../src/bak.c",line 124,column 5,is_stmt,isa 0
        MOV.W     #0,r12                ; [] |124| 
$C$DW$84	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$84, DW_AT_low_pc(0x00)
	.dwattr $C$DW$84, DW_AT_TI_return

        RETA      ; [] 
        ; [] 
	.dwattr $C$DW$72, DW_AT_TI_end_file("../src/bak.c")
	.dwattr $C$DW$72, DW_AT_TI_end_line(0x7d)
	.dwattr $C$DW$72, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$72

;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	BAKMEM0
	.global	BAKMEM1
	.global	BAKMEM1_L
	.global	BAKMEM1_H
	.global	BAKMEM2
	.global	BAKMEM2_L
	.global	BAKMEM2_H
	.global	BAKMEM3
	.global	BAKMEM3_L
	.global	BAKMEM3_H
	.global	MAIN_CurrentTime
	.global	CH_Channels
	.global	CLK_GetRTC

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
	.battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ00000000000011111000000000000000000000000000")
	.battr "TI", Tag_File, 1, Tag_LEA_INFO(1)
	.battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
	.battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
	.battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(2)
	.battr "mspabi", Tag_File, 1, Tag_enum_size(3)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x0c)
$C$DW$85	.dwtag  DW_TAG_member
	.dwattr $C$DW$85, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$85, DW_AT_name("year")
	.dwattr $C$DW$85, DW_AT_TI_symbol_name("year")
	.dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$85, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\inc\clk.h")
	.dwattr $C$DW$85, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$85, DW_AT_decl_column(0x11)

$C$DW$86	.dwtag  DW_TAG_member
	.dwattr $C$DW$86, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$86, DW_AT_name("month")
	.dwattr $C$DW$86, DW_AT_TI_symbol_name("month")
	.dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$86, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\inc\clk.h")
	.dwattr $C$DW$86, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$86, DW_AT_decl_column(0x11)

$C$DW$87	.dwtag  DW_TAG_member
	.dwattr $C$DW$87, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$87, DW_AT_name("day")
	.dwattr $C$DW$87, DW_AT_TI_symbol_name("day")
	.dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$87, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\inc\clk.h")
	.dwattr $C$DW$87, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$87, DW_AT_decl_column(0x11)

$C$DW$88	.dwtag  DW_TAG_member
	.dwattr $C$DW$88, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$88, DW_AT_name("hour")
	.dwattr $C$DW$88, DW_AT_TI_symbol_name("hour")
	.dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$88, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\inc\clk.h")
	.dwattr $C$DW$88, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$88, DW_AT_decl_column(0x11)

$C$DW$89	.dwtag  DW_TAG_member
	.dwattr $C$DW$89, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$89, DW_AT_name("min")
	.dwattr $C$DW$89, DW_AT_TI_symbol_name("min")
	.dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$89, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\inc\clk.h")
	.dwattr $C$DW$89, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$89, DW_AT_decl_column(0x11)

$C$DW$90	.dwtag  DW_TAG_member
	.dwattr $C$DW$90, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$90, DW_AT_name("sec")
	.dwattr $C$DW$90, DW_AT_TI_symbol_name("sec")
	.dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$90, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\inc\clk.h")
	.dwattr $C$DW$90, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$90, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$23, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\inc\clk.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$23

$C$DW$T$32	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$32, DW_AT_name("CLK_TimeStamp")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$32, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\inc\clk.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x30)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x03)

$C$DW$T$33	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$33, DW_AT_address_class(0x14)


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x6a)
$C$DW$91	.dwtag  DW_TAG_member
	.dwattr $C$DW$91, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$91, DW_AT_name("id")
	.dwattr $C$DW$91, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$91, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$91, DW_AT_decl_line(0x22)
	.dwattr $C$DW$91, DW_AT_decl_column(0x15)

$C$DW$92	.dwtag  DW_TAG_member
	.dwattr $C$DW$92, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$92, DW_AT_name("typeid")
	.dwattr $C$DW$92, DW_AT_TI_symbol_name("typeid")
	.dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$92, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$92, DW_AT_decl_line(0x23)
	.dwattr $C$DW$92, DW_AT_decl_column(0x15)

$C$DW$93	.dwtag  DW_TAG_member
	.dwattr $C$DW$93, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$93, DW_AT_name("pregain")
	.dwattr $C$DW$93, DW_AT_TI_symbol_name("pregain")
	.dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$93, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$93, DW_AT_decl_line(0x24)
	.dwattr $C$DW$93, DW_AT_decl_column(0x15)

$C$DW$94	.dwtag  DW_TAG_member
	.dwattr $C$DW$94, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$94, DW_AT_name("gain")
	.dwattr $C$DW$94, DW_AT_TI_symbol_name("gain")
	.dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$94, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$94, DW_AT_decl_line(0x25)
	.dwattr $C$DW$94, DW_AT_decl_column(0x15)

$C$DW$95	.dwtag  DW_TAG_member
	.dwattr $C$DW$95, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$95, DW_AT_name("attenuation")
	.dwattr $C$DW$95, DW_AT_TI_symbol_name("attenuation")
	.dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$95, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$95, DW_AT_decl_line(0x26)
	.dwattr $C$DW$95, DW_AT_decl_column(0x15)

$C$DW$96	.dwtag  DW_TAG_member
	.dwattr $C$DW$96, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$96, DW_AT_name("DACbuffer")
	.dwattr $C$DW$96, DW_AT_TI_symbol_name("DACbuffer")
	.dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$96, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$96, DW_AT_decl_line(0x29)
	.dwattr $C$DW$96, DW_AT_decl_column(0x15)

$C$DW$97	.dwtag  DW_TAG_member
	.dwattr $C$DW$97, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$97, DW_AT_name("tap1")
	.dwattr $C$DW$97, DW_AT_TI_symbol_name("tap1")
	.dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$97, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$97, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$97, DW_AT_decl_column(0x15)

$C$DW$98	.dwtag  DW_TAG_member
	.dwattr $C$DW$98, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$98, DW_AT_name("tap2")
	.dwattr $C$DW$98, DW_AT_TI_symbol_name("tap2")
	.dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$98, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$98, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$98, DW_AT_decl_column(0x15)

$C$DW$99	.dwtag  DW_TAG_member
	.dwattr $C$DW$99, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$99, DW_AT_name("xtap1")
	.dwattr $C$DW$99, DW_AT_TI_symbol_name("xtap1")
	.dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$99, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$99, DW_AT_decl_line(0x30)
	.dwattr $C$DW$99, DW_AT_decl_column(0x15)

$C$DW$100	.dwtag  DW_TAG_member
	.dwattr $C$DW$100, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$100, DW_AT_name("xtap2")
	.dwattr $C$DW$100, DW_AT_TI_symbol_name("xtap2")
	.dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$100, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$100, DW_AT_decl_line(0x31)
	.dwattr $C$DW$100, DW_AT_decl_column(0x15)

$C$DW$101	.dwtag  DW_TAG_member
	.dwattr $C$DW$101, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$101, DW_AT_name("ytap1")
	.dwattr $C$DW$101, DW_AT_TI_symbol_name("ytap1")
	.dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$101, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$101, DW_AT_decl_line(0x32)
	.dwattr $C$DW$101, DW_AT_decl_column(0x15)

$C$DW$102	.dwtag  DW_TAG_member
	.dwattr $C$DW$102, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$102, DW_AT_name("ytap2")
	.dwattr $C$DW$102, DW_AT_TI_symbol_name("ytap2")
	.dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
	.dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$102, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$102, DW_AT_decl_line(0x33)
	.dwattr $C$DW$102, DW_AT_decl_column(0x15)

$C$DW$103	.dwtag  DW_TAG_member
	.dwattr $C$DW$103, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$103, DW_AT_name("cycles")
	.dwattr $C$DW$103, DW_AT_TI_symbol_name("cycles")
	.dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
	.dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$103, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$103, DW_AT_decl_line(0x35)
	.dwattr $C$DW$103, DW_AT_decl_column(0x15)

$C$DW$104	.dwtag  DW_TAG_member
	.dwattr $C$DW$104, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$104, DW_AT_name("seqcycles")
	.dwattr $C$DW$104, DW_AT_TI_symbol_name("seqcycles")
	.dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$104, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$104, DW_AT_decl_line(0x36)
	.dwattr $C$DW$104, DW_AT_decl_column(0x15)

$C$DW$105	.dwtag  DW_TAG_member
	.dwattr $C$DW$105, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$105, DW_AT_name("next")
	.dwattr $C$DW$105, DW_AT_TI_symbol_name("next")
	.dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
	.dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$105, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$105, DW_AT_decl_line(0x37)
	.dwattr $C$DW$105, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x21)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$27

$C$DW$T$35	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$35, DW_AT_name("CH_ChannelSpec")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/inc/channels.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x39)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x03)

$C$DW$T$36	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$36, DW_AT_address_class(0x14)


$C$DW$T$37	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
$C$DW$106	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$106, DW_AT_upper_bound(0x04)

	.dwendtag $C$DW$T$37


$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x10)
$C$DW$107	.dwtag  DW_TAG_member
	.dwattr $C$DW$107, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$107, DW_AT_name("__max_align1")
	.dwattr $C$DW$107, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$107, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$107, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$107, DW_AT_decl_column(0x0c)

$C$DW$108	.dwtag  DW_TAG_member
	.dwattr $C$DW$108, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$108, DW_AT_name("__max_align2")
	.dwattr $C$DW$108, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$108, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$108, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$108, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$28

$C$DW$T$41	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$41, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x03)


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
$C$DW$109	.dwtag  DW_TAG_member
	.dwattr $C$DW$109, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$109, DW_AT_name("quot")
	.dwattr $C$DW$109, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$109, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/stdlib.h")
	.dwattr $C$DW$109, DW_AT_decl_line(0x56)
	.dwattr $C$DW$109, DW_AT_decl_column(0x16)

$C$DW$110	.dwtag  DW_TAG_member
	.dwattr $C$DW$110, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$110, DW_AT_name("rem")
	.dwattr $C$DW$110, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$110, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/stdlib.h")
	.dwattr $C$DW$110, DW_AT_decl_line(0x56)
	.dwattr $C$DW$110, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x56)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$29

$C$DW$T$42	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$42, DW_AT_name("div_t")
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x56)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x23)


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
$C$DW$111	.dwtag  DW_TAG_member
	.dwattr $C$DW$111, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$111, DW_AT_name("quot")
	.dwattr $C$DW$111, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$111, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/stdlib.h")
	.dwattr $C$DW$111, DW_AT_decl_line(0x59)
	.dwattr $C$DW$111, DW_AT_decl_column(0x17)

$C$DW$112	.dwtag  DW_TAG_member
	.dwattr $C$DW$112, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$112, DW_AT_name("rem")
	.dwattr $C$DW$112, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$112, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/stdlib.h")
	.dwattr $C$DW$112, DW_AT_decl_line(0x59)
	.dwattr $C$DW$112, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x59)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$30

$C$DW$T$43	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$43, DW_AT_name("ldiv_t")
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x59)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x24)


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x10)
$C$DW$113	.dwtag  DW_TAG_member
	.dwattr $C$DW$113, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$113, DW_AT_name("quot")
	.dwattr $C$DW$113, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$113, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/stdlib.h")
	.dwattr $C$DW$113, DW_AT_decl_line(0x63)
	.dwattr $C$DW$113, DW_AT_decl_column(0x1c)

$C$DW$114	.dwtag  DW_TAG_member
	.dwattr $C$DW$114, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$114, DW_AT_name("rem")
	.dwattr $C$DW$114, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$114, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/stdlib.h")
	.dwattr $C$DW$114, DW_AT_decl_line(0x63)
	.dwattr $C$DW$114, DW_AT_decl_column(0x22)

	.dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x63)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$31

$C$DW$T$44	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$44, DW_AT_name("lldiv_t")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x63)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x29)

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x14)


$C$DW$T$47	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
	.dwendtag $C$DW$T$47

$C$DW$T$48	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$48, DW_AT_address_class(0x14)

$C$DW$T$49	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$49, DW_AT_name("__TI_atexit_fn")
	.dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x14)


$C$DW$T$50	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
	.dwendtag $C$DW$T$50

$C$DW$T$51	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$51, DW_AT_address_class(0x14)

$C$DW$T$52	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$52, DW_AT_name("__SFR_FARPTR")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$52, DW_AT_decl_file("C:\ti\ccs1250\ccs\ccs_base\msp430\include\msp430fg6626.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x46)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x11)

$C$DW$115	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$115, DW_AT_type(*$C$DW$T$2)

$C$DW$T$53	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$115)

$C$DW$T$54	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$54, DW_AT_address_class(0x14)

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$55	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$55, DW_AT_name("__int8_t")
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x16)

$C$DW$T$56	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$56, DW_AT_name("__int_least8_t")
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x12)

$C$DW$T$57	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$57, DW_AT_name("int_least8_t")
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
