MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Mon Feb 24 13:22:57 2025                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../main.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\Deb
      12            ;       Interrupt vector table mappings
      13 000000               .intvec ".int50",       DMA_ISR
         000000       
      14 000000               .intvec ".int42",       RTCISR
         000000       
      15            $C$DW$1 .dwtag  DW_TAG_variable

   11140                    .global DMA_SetDMA0
   11141                    .global DMA_SetDMA1
   11142                    .global TIMER_StartTimer0AND1
   11143                    .global TIMER_StartTimer0
   11144                    .global TIMER_ResetTimer0
   11145                    .global TIMER_ResetTimer1
   11146                    .global TIMER_StartTimer1
   11147                    .global ADC_CheckChannelGain
   11148                    .global STATE_GetStateName
   11149                    .global PIXIE_TypeStrings
   11150                    .global DSP_AnalysisLoop
   11151                    .global sqrt
   11152                    .global CLK_SetRTC
   11153                    .global CLK_GetRTC
   11154                    .global __mspabi_srli
   11155                    .global __mspabi_srlll
   11156                    .global __mspabi_fltuld
   11157                    .global __mspabi_mpyl_sw
   11158                    .global __mspabi_cmpd
   11159                    .global __mspabi_fixdu
   11160            ;*****************************************************************************
   11161            ;* SECTION GROUPS                                                            *
   11162            ;*****************************************************************************
   11163                    .group    "__fpclassify", 1
   11164                    .gmember  ".text:__fpclassify"
   11165                    .endgroup
   11166                    .group    "__fpclassifyf", 1
   11167                    .gmember  ".text:__fpclassifyf"
   11168                    .endgroup
   11169                    .group    "__fpclassifyl", 1
   11170                    .gmember  ".text:__fpclassifyl"
   11171                    .endgroup
   11172                    .group    "__isfinite", 1
   11173                    .gmember  ".text:__isfinite"
   11174                    .endgroup
   11175                    .group    "__isfinitef", 1
   11176                    .gmember  ".text:__isfinitef"
   11177                    .endgroup
   11178                    .group    "__isfinitel", 1
   11179                    .gmember  ".text:__isfinitel"
   11180                    .endgroup
   11181                    .group    "__isinf", 1
   11182                    .gmember  ".text:__isinf"
   11183                    .endgroup
   11184                    .group    "__isinff", 1
   11185                    .gmember  ".text:__isinff"
   11186                    .endgroup
   11187                    .group    "__isinfl", 1
   11188                    .gmember  ".text:__isinfl"
   11189                    .endgroup
   11190                    .group    "__isnan", 1
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  268

   11191                    .gmember  ".text:__isnan"
   11192                    .endgroup
   11193                    .group    "__isnanf", 1
   11194                    .gmember  ".text:__isnanf"
   11195                    .endgroup
   11196                    .group    "__isnanl", 1
   11197                    .gmember  ".text:__isnanl"
   11198                    .endgroup
   11199                    .group    "__isnormal", 1
   11200                    .gmember  ".text:__isnormal"
   11201                    .endgroup
   11202                    .group    "__isnormalf", 1
   11203                    .gmember  ".text:__isnormalf"
   11204                    .endgroup
   11205                    .group    "__isnormall", 1
   11206                    .gmember  ".text:__isnormall"
   11207                    .endgroup
   11208                    .group    "__signbit", 1
   11209                    .gmember  ".text:__signbit"
   11210                    .endgroup
   11211                    .group    "__signbitf", 1
   11212                    .gmember  ".text:__signbitf"
   11213                    .endgroup
   11214                    .group    "__signbitl", 1
   11215                    .gmember  ".text:__signbitl"
   11216                    .endgroup
   11217            
   11218            
   11219            ;******************************************************************************
   11220            ;* BUILD ATTRIBUTES                                                           *
   11221            ;******************************************************************************
   11222                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(2)
   11223                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111100000000
   11224                    .battr "TI", Tag_File, 1, Tag_LEA_INFO(1)
   11225                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
   11226                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(3)
   11227                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(2)
   11228                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
   11229            
   11230            ;******************************************************************************
   11231            ;* TYPE INFORMATION                                                           *
   11232            ;******************************************************************************
   11233            
   11234            $C$DW$T$24      .dwtag  DW_TAG_structure_type
   11235                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
   11236            $C$DW$482       .dwtag  DW_TAG_member
   11237                    .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$23)
   11238                    .dwattr $C$DW$482, DW_AT_name("year")
   11239                    .dwattr $C$DW$482, DW_AT_TI_symbol_name("year")
   11240                    .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11241                    .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
   11242                    .dwattr $C$DW$482, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\i
   11243                    .dwattr $C$DW$482, DW_AT_decl_line(0x2a)
   11244                    .dwattr $C$DW$482, DW_AT_decl_column(0x11)
   11245            
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  269

   11246            $C$DW$483       .dwtag  DW_TAG_member
   11247                    .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$23)
   11248                    .dwattr $C$DW$483, DW_AT_name("month")
   11249                    .dwattr $C$DW$483, DW_AT_TI_symbol_name("month")
   11250                    .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11251                    .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
   11252                    .dwattr $C$DW$483, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\i
   11253                    .dwattr $C$DW$483, DW_AT_decl_line(0x2b)
   11254                    .dwattr $C$DW$483, DW_AT_decl_column(0x11)
   11255            
   11256            $C$DW$484       .dwtag  DW_TAG_member
   11257                    .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$23)
   11258                    .dwattr $C$DW$484, DW_AT_name("day")
   11259                    .dwattr $C$DW$484, DW_AT_TI_symbol_name("day")
   11260                    .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11261                    .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
   11262                    .dwattr $C$DW$484, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\i
   11263                    .dwattr $C$DW$484, DW_AT_decl_line(0x2c)
   11264                    .dwattr $C$DW$484, DW_AT_decl_column(0x11)
   11265            
   11266            $C$DW$485       .dwtag  DW_TAG_member
   11267                    .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$23)
   11268                    .dwattr $C$DW$485, DW_AT_name("hour")
   11269                    .dwattr $C$DW$485, DW_AT_TI_symbol_name("hour")
   11270                    .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11271                    .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
   11272                    .dwattr $C$DW$485, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\i
   11273                    .dwattr $C$DW$485, DW_AT_decl_line(0x2d)
   11274                    .dwattr $C$DW$485, DW_AT_decl_column(0x11)
   11275            
   11276            $C$DW$486       .dwtag  DW_TAG_member
   11277                    .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$23)
   11278                    .dwattr $C$DW$486, DW_AT_name("min")
   11279                    .dwattr $C$DW$486, DW_AT_TI_symbol_name("min")
   11280                    .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11281                    .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
   11282                    .dwattr $C$DW$486, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\i
   11283                    .dwattr $C$DW$486, DW_AT_decl_line(0x2e)
   11284                    .dwattr $C$DW$486, DW_AT_decl_column(0x11)
   11285            
   11286            $C$DW$487       .dwtag  DW_TAG_member
   11287                    .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$23)
   11288                    .dwattr $C$DW$487, DW_AT_name("sec")
   11289                    .dwattr $C$DW$487, DW_AT_TI_symbol_name("sec")
   11290                    .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11291                    .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
   11292                    .dwattr $C$DW$487, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\i
   11293                    .dwattr $C$DW$487, DW_AT_decl_line(0x2f)
   11294                    .dwattr $C$DW$487, DW_AT_decl_column(0x11)
   11295            
   11296                    .dwattr $C$DW$T$24, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\
   11297                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x29)
   11298                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
   11299                    .dwendtag $C$DW$T$24
   11300            
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  270

   11301            $C$DW$T$43      .dwtag  DW_TAG_typedef
   11302                    .dwattr $C$DW$T$43, DW_AT_name("CLK_TimeStamp")
   11303                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$24)
   11304                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   11305                    .dwattr $C$DW$T$43, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\
   11306                    .dwattr $C$DW$T$43, DW_AT_decl_line(0x30)
   11307                    .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
   11308            
   11309            $C$DW$T$50      .dwtag  DW_TAG_pointer_type
   11310                    .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$43)
   11311                    .dwattr $C$DW$T$50, DW_AT_address_class(0x14)
   11312            
   11313            
   11314            $C$DW$T$28      .dwtag  DW_TAG_structure_type
   11315                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x6a)
   11316            $C$DW$488       .dwtag  DW_TAG_member
   11317                    .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$23)
   11318                    .dwattr $C$DW$488, DW_AT_name("id")
   11319                    .dwattr $C$DW$488, DW_AT_TI_symbol_name("id")
   11320                    .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11321                    .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
   11322                    .dwattr $C$DW$488, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11323                    .dwattr $C$DW$488, DW_AT_decl_line(0x22)
   11324                    .dwattr $C$DW$488, DW_AT_decl_column(0x15)
   11325            
   11326            $C$DW$489       .dwtag  DW_TAG_member
   11327                    .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$23)
   11328                    .dwattr $C$DW$489, DW_AT_name("typeid")
   11329                    .dwattr $C$DW$489, DW_AT_TI_symbol_name("typeid")
   11330                    .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11331                    .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
   11332                    .dwattr $C$DW$489, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11333                    .dwattr $C$DW$489, DW_AT_decl_line(0x23)
   11334                    .dwattr $C$DW$489, DW_AT_decl_column(0x15)
   11335            
   11336            $C$DW$490       .dwtag  DW_TAG_member
   11337                    .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$23)
   11338                    .dwattr $C$DW$490, DW_AT_name("pregain")
   11339                    .dwattr $C$DW$490, DW_AT_TI_symbol_name("pregain")
   11340                    .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11341                    .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
   11342                    .dwattr $C$DW$490, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11343                    .dwattr $C$DW$490, DW_AT_decl_line(0x24)
   11344                    .dwattr $C$DW$490, DW_AT_decl_column(0x15)
   11345            
   11346            $C$DW$491       .dwtag  DW_TAG_member
   11347                    .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$23)
   11348                    .dwattr $C$DW$491, DW_AT_name("gain")
   11349                    .dwattr $C$DW$491, DW_AT_TI_symbol_name("gain")
   11350                    .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11351                    .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
   11352                    .dwattr $C$DW$491, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11353                    .dwattr $C$DW$491, DW_AT_decl_line(0x25)
   11354                    .dwattr $C$DW$491, DW_AT_decl_column(0x15)
   11355            
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  271

   11356            $C$DW$492       .dwtag  DW_TAG_member
   11357                    .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$23)
   11358                    .dwattr $C$DW$492, DW_AT_name("attenuation")
   11359                    .dwattr $C$DW$492, DW_AT_TI_symbol_name("attenuation")
   11360                    .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11361                    .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
   11362                    .dwattr $C$DW$492, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11363                    .dwattr $C$DW$492, DW_AT_decl_line(0x26)
   11364                    .dwattr $C$DW$492, DW_AT_decl_column(0x15)
   11365            
   11366            $C$DW$493       .dwtag  DW_TAG_member
   11367                    .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$25)
   11368                    .dwattr $C$DW$493, DW_AT_name("DACbuffer")
   11369                    .dwattr $C$DW$493, DW_AT_TI_symbol_name("DACbuffer")
   11370                    .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11371                    .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
   11372                    .dwattr $C$DW$493, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11373                    .dwattr $C$DW$493, DW_AT_decl_line(0x29)
   11374                    .dwattr $C$DW$493, DW_AT_decl_column(0x15)
   11375            
   11376            $C$DW$494       .dwtag  DW_TAG_member
   11377                    .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$27)
   11378                    .dwattr $C$DW$494, DW_AT_name("tap1")
   11379                    .dwattr $C$DW$494, DW_AT_TI_symbol_name("tap1")
   11380                    .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   11381                    .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
   11382                    .dwattr $C$DW$494, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11383                    .dwattr $C$DW$494, DW_AT_decl_line(0x2e)
   11384                    .dwattr $C$DW$494, DW_AT_decl_column(0x15)
   11385            
   11386            $C$DW$495       .dwtag  DW_TAG_member
   11387                    .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$27)
   11388                    .dwattr $C$DW$495, DW_AT_name("tap2")
   11389                    .dwattr $C$DW$495, DW_AT_TI_symbol_name("tap2")
   11390                    .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   11391                    .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
   11392                    .dwattr $C$DW$495, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11393                    .dwattr $C$DW$495, DW_AT_decl_line(0x2f)
   11394                    .dwattr $C$DW$495, DW_AT_decl_column(0x15)
   11395            
   11396            $C$DW$496       .dwtag  DW_TAG_member
   11397                    .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$27)
   11398                    .dwattr $C$DW$496, DW_AT_name("xtap1")
   11399                    .dwattr $C$DW$496, DW_AT_TI_symbol_name("xtap1")
   11400                    .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
   11401                    .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
   11402                    .dwattr $C$DW$496, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11403                    .dwattr $C$DW$496, DW_AT_decl_line(0x30)
   11404                    .dwattr $C$DW$496, DW_AT_decl_column(0x15)
   11405            
   11406            $C$DW$497       .dwtag  DW_TAG_member
   11407                    .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$27)
   11408                    .dwattr $C$DW$497, DW_AT_name("xtap2")
   11409                    .dwattr $C$DW$497, DW_AT_TI_symbol_name("xtap2")
   11410                    .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  272

   11411                    .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
   11412                    .dwattr $C$DW$497, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11413                    .dwattr $C$DW$497, DW_AT_decl_line(0x31)
   11414                    .dwattr $C$DW$497, DW_AT_decl_column(0x15)
   11415            
   11416            $C$DW$498       .dwtag  DW_TAG_member
   11417                    .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$27)
   11418                    .dwattr $C$DW$498, DW_AT_name("ytap1")
   11419                    .dwattr $C$DW$498, DW_AT_TI_symbol_name("ytap1")
   11420                    .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   11421                    .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
   11422                    .dwattr $C$DW$498, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11423                    .dwattr $C$DW$498, DW_AT_decl_line(0x32)
   11424                    .dwattr $C$DW$498, DW_AT_decl_column(0x15)
   11425            
   11426            $C$DW$499       .dwtag  DW_TAG_member
   11427                    .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$27)
   11428                    .dwattr $C$DW$499, DW_AT_name("ytap2")
   11429                    .dwattr $C$DW$499, DW_AT_TI_symbol_name("ytap2")
   11430                    .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   11431                    .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
   11432                    .dwattr $C$DW$499, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11433                    .dwattr $C$DW$499, DW_AT_decl_line(0x33)
   11434                    .dwattr $C$DW$499, DW_AT_decl_column(0x15)
   11435            
   11436            $C$DW$500       .dwtag  DW_TAG_member
   11437                    .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$23)
   11438                    .dwattr $C$DW$500, DW_AT_name("cycles")
   11439                    .dwattr $C$DW$500, DW_AT_TI_symbol_name("cycles")
   11440                    .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
   11441                    .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
   11442                    .dwattr $C$DW$500, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11443                    .dwattr $C$DW$500, DW_AT_decl_line(0x35)
   11444                    .dwattr $C$DW$500, DW_AT_decl_column(0x15)
   11445            
   11446            $C$DW$501       .dwtag  DW_TAG_member
   11447                    .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$23)
   11448                    .dwattr $C$DW$501, DW_AT_name("seqcycles")
   11449                    .dwattr $C$DW$501, DW_AT_TI_symbol_name("seqcycles")
   11450                    .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
   11451                    .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
   11452                    .dwattr $C$DW$501, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11453                    .dwattr $C$DW$501, DW_AT_decl_line(0x36)
   11454                    .dwattr $C$DW$501, DW_AT_decl_column(0x15)
   11455            
   11456            $C$DW$502       .dwtag  DW_TAG_member
   11457                    .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$3)
   11458                    .dwattr $C$DW$502, DW_AT_name("next")
   11459                    .dwattr $C$DW$502, DW_AT_TI_symbol_name("next")
   11460                    .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
   11461                    .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
   11462                    .dwattr $C$DW$502, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11463                    .dwattr $C$DW$502, DW_AT_decl_line(0x37)
   11464                    .dwattr $C$DW$502, DW_AT_decl_column(0x15)
   11465            
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  273

   11466                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
   11467                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x21)
   11468                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
   11469                    .dwendtag $C$DW$T$28
   11470            
   11471            $C$DW$T$52      .dwtag  DW_TAG_typedef
   11472                    .dwattr $C$DW$T$52, DW_AT_name("CH_ChannelSpec")
   11473                    .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$28)
   11474                    .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
   11475                    .dwattr $C$DW$T$52, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
   11476                    .dwattr $C$DW$T$52, DW_AT_decl_line(0x39)
   11477                    .dwattr $C$DW$T$52, DW_AT_decl_column(0x03)
   11478            
   11479            $C$DW$T$53      .dwtag  DW_TAG_pointer_type
   11480                    .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
   11481                    .dwattr $C$DW$T$53, DW_AT_address_class(0x14)
   11482            
   11483            
   11484            $C$DW$T$54      .dwtag  DW_TAG_array_type
   11485                    .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
   11486                    .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
   11487                    .dwattr $C$DW$T$54, DW_AT_byte_size(0x14)
   11488            $C$DW$503       .dwtag  DW_TAG_subrange_type
   11489                    .dwattr $C$DW$503, DW_AT_upper_bound(0x04)
   11490            
   11491                    .dwendtag $C$DW$T$54
   11492            
   11493            
   11494            $C$DW$T$55      .dwtag  DW_TAG_array_type
   11495                    .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$52)
   11496                    .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
   11497                    .dwattr $C$DW$T$55, DW_AT_byte_size(0x1a8)
   11498            $C$DW$504       .dwtag  DW_TAG_subrange_type
   11499                    .dwattr $C$DW$504, DW_AT_upper_bound(0x03)
   11500            
   11501                    .dwendtag $C$DW$T$55
   11502            
   11503            
   11504            $C$DW$T$29      .dwtag  DW_TAG_structure_type
   11505                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
   11506            $C$DW$505       .dwtag  DW_TAG_member
   11507                    .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$23)
   11508                    .dwattr $C$DW$505, DW_AT_name("channel")
   11509                    .dwattr $C$DW$505, DW_AT_TI_symbol_name("channel")
   11510                    .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11511                    .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
   11512                    .dwattr $C$DW$505, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11513                    .dwattr $C$DW$505, DW_AT_decl_line(0x58)
   11514                    .dwattr $C$DW$505, DW_AT_decl_column(0x15)
   11515            
   11516                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
   11517                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x57)
   11518                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
   11519                    .dwendtag $C$DW$T$29
   11520            
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  274

   11521            $C$DW$T$44      .dwtag  DW_TAG_typedef
   11522                    .dwattr $C$DW$T$44, DW_AT_name("CMD_ChannelArgs")
   11523                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$29)
   11524                    .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
   11525                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
   11526                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x59)
   11527                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
   11528            
   11529            
   11530            $C$DW$T$30      .dwtag  DW_TAG_structure_type
   11531                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
   11532            $C$DW$506       .dwtag  DW_TAG_member
   11533                    .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$23)
   11534                    .dwattr $C$DW$506, DW_AT_name("channel")
   11535                    .dwattr $C$DW$506, DW_AT_TI_symbol_name("channel")
   11536                    .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11537                    .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
   11538                    .dwattr $C$DW$506, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11539                    .dwattr $C$DW$506, DW_AT_decl_line(0x5d)
   11540                    .dwattr $C$DW$506, DW_AT_decl_column(0x15)
   11541            
   11542            $C$DW$507       .dwtag  DW_TAG_member
   11543                    .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$23)
   11544                    .dwattr $C$DW$507, DW_AT_name("value")
   11545                    .dwattr $C$DW$507, DW_AT_TI_symbol_name("value")
   11546                    .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11547                    .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
   11548                    .dwattr $C$DW$507, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11549                    .dwattr $C$DW$507, DW_AT_decl_line(0x5e)
   11550                    .dwattr $C$DW$507, DW_AT_decl_column(0x15)
   11551            
   11552                    .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
   11553                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x5c)
   11554                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
   11555                    .dwendtag $C$DW$T$30
   11556            
   11557            $C$DW$T$45      .dwtag  DW_TAG_typedef
   11558                    .dwattr $C$DW$T$45, DW_AT_name("CMD_SettingArgs")
   11559                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$30)
   11560                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
   11561                    .dwattr $C$DW$T$45, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
   11562                    .dwattr $C$DW$T$45, DW_AT_decl_line(0x5f)
   11563                    .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
   11564            
   11565            
   11566            $C$DW$T$31      .dwtag  DW_TAG_structure_type
   11567                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
   11568            $C$DW$508       .dwtag  DW_TAG_member
   11569                    .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$23)
   11570                    .dwattr $C$DW$508, DW_AT_name("channel")
   11571                    .dwattr $C$DW$508, DW_AT_TI_symbol_name("channel")
   11572                    .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11573                    .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
   11574                    .dwattr $C$DW$508, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11575                    .dwattr $C$DW$508, DW_AT_decl_line(0x63)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  275

   11576                    .dwattr $C$DW$508, DW_AT_decl_column(0x15)
   11577            
   11578            $C$DW$509       .dwtag  DW_TAG_member
   11579                    .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$23)
   11580                    .dwattr $C$DW$509, DW_AT_name("duration")
   11581                    .dwattr $C$DW$509, DW_AT_TI_symbol_name("duration")
   11582                    .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11583                    .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
   11584                    .dwattr $C$DW$509, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11585                    .dwattr $C$DW$509, DW_AT_decl_line(0x64)
   11586                    .dwattr $C$DW$509, DW_AT_decl_column(0x15)
   11587            
   11588                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
   11589                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x62)
   11590                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
   11591                    .dwendtag $C$DW$T$31
   11592            
   11593            $C$DW$T$46      .dwtag  DW_TAG_typedef
   11594                    .dwattr $C$DW$T$46, DW_AT_name("CMD_RunningArgs")
   11595                    .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$31)
   11596                    .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
   11597                    .dwattr $C$DW$T$46, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
   11598                    .dwattr $C$DW$T$46, DW_AT_decl_line(0x65)
   11599                    .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
   11600            
   11601            
   11602            $C$DW$T$33      .dwtag  DW_TAG_structure_type
   11603                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
   11604            $C$DW$510       .dwtag  DW_TAG_member
   11605                    .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$23)
   11606                    .dwattr $C$DW$510, DW_AT_name("id")
   11607                    .dwattr $C$DW$510, DW_AT_TI_symbol_name("id")
   11608                    .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11609                    .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
   11610                    .dwattr $C$DW$510, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11611                    .dwattr $C$DW$510, DW_AT_decl_line(0x8a)
   11612                    .dwattr $C$DW$510, DW_AT_decl_column(0x15)
   11613            
   11614            $C$DW$511       .dwtag  DW_TAG_member
   11615                    .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$32)
   11616                    .dwattr $C$DW$511, DW_AT_name("data")
   11617                    .dwattr $C$DW$511, DW_AT_TI_symbol_name("data")
   11618                    .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11619                    .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
   11620                    .dwattr $C$DW$511, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11621                    .dwattr $C$DW$511, DW_AT_decl_line(0x8b)
   11622                    .dwattr $C$DW$511, DW_AT_decl_column(0x15)
   11623            
   11624                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
   11625                    .dwattr $C$DW$T$33, DW_AT_decl_line(0x89)
   11626                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
   11627                    .dwendtag $C$DW$T$33
   11628            
   11629            $C$DW$T$60      .dwtag  DW_TAG_typedef
   11630                    .dwattr $C$DW$T$60, DW_AT_name("CMD_CommandContainer")
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  276

   11631                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$33)
   11632                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
   11633                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
   11634                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x8c)
   11635                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
   11636            
   11637            
   11638            $C$DW$T$38      .dwtag  DW_TAG_structure_type
   11639                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x42)
   11640            $C$DW$512       .dwtag  DW_TAG_member
   11641                    .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$35)
   11642                    .dwattr $C$DW$512, DW_AT_name("buffer")
   11643                    .dwattr $C$DW$512, DW_AT_TI_symbol_name("buffer")
   11644                    .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11645                    .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
   11646                    .dwattr $C$DW$512, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11647                    .dwattr $C$DW$512, DW_AT_decl_line(0x2a)
   11648                    .dwattr $C$DW$512, DW_AT_decl_column(0x11)
   11649            
   11650            $C$DW$513       .dwtag  DW_TAG_member
   11651                    .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$37)
   11652                    .dwattr $C$DW$513, DW_AT_name("len")
   11653                    .dwattr $C$DW$513, DW_AT_TI_symbol_name("len")
   11654                    .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   11655                    .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
   11656                    .dwattr $C$DW$513, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11657                    .dwattr $C$DW$513, DW_AT_decl_line(0x2b)
   11658                    .dwattr $C$DW$513, DW_AT_decl_column(0x11)
   11659            
   11660            $C$DW$514       .dwtag  DW_TAG_member
   11661                    .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$37)
   11662                    .dwattr $C$DW$514, DW_AT_name("pos")
   11663                    .dwattr $C$DW$514, DW_AT_TI_symbol_name("pos")
   11664                    .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
   11665                    .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
   11666                    .dwattr $C$DW$514, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11667                    .dwattr $C$DW$514, DW_AT_decl_line(0x2c)
   11668                    .dwattr $C$DW$514, DW_AT_decl_column(0x11)
   11669            
   11670                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
   11671                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x29)
   11672                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
   11673                    .dwendtag $C$DW$T$38
   11674            
   11675            $C$DW$T$62      .dwtag  DW_TAG_typedef
   11676                    .dwattr $C$DW$T$62, DW_AT_name("UART_Buffer")
   11677                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$38)
   11678                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   11679                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
   11680                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x2d)
   11681                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
   11682            
   11683            
   11684            $C$DW$T$39      .dwtag  DW_TAG_structure_type
   11685                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x10)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  277

   11686            $C$DW$515       .dwtag  DW_TAG_member
   11687                    .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$14)
   11688                    .dwattr $C$DW$515, DW_AT_name("__max_align1")
   11689                    .dwattr $C$DW$515, DW_AT_TI_symbol_name("__max_align1")
   11690                    .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11691                    .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
   11692                    .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
   11693                    .dwattr $C$DW$515, DW_AT_decl_line(0x7b)
   11694                    .dwattr $C$DW$515, DW_AT_decl_column(0x0c)
   11695            
   11696            $C$DW$516       .dwtag  DW_TAG_member
   11697                    .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$18)
   11698                    .dwattr $C$DW$516, DW_AT_name("__max_align2")
   11699                    .dwattr $C$DW$516, DW_AT_TI_symbol_name("__max_align2")
   11700                    .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11701                    .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
   11702                    .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
   11703                    .dwattr $C$DW$516, DW_AT_decl_line(0x7c)
   11704                    .dwattr $C$DW$516, DW_AT_decl_column(0x0e)
   11705            
   11706                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   11707                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x7a)
   11708                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
   11709                    .dwendtag $C$DW$T$39
   11710            
   11711            $C$DW$T$64      .dwtag  DW_TAG_typedef
   11712                    .dwattr $C$DW$T$64, DW_AT_name("__max_align_t")
   11713                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$39)
   11714                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   11715                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   11716                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x7d)
   11717                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
   11718            
   11719            
   11720            $C$DW$T$40      .dwtag  DW_TAG_structure_type
   11721                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
   11722            $C$DW$517       .dwtag  DW_TAG_member
   11723                    .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$10)
   11724                    .dwattr $C$DW$517, DW_AT_name("quot")
   11725                    .dwattr $C$DW$517, DW_AT_TI_symbol_name("quot")
   11726                    .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11727                    .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
   11728                    .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
   11729                    .dwattr $C$DW$517, DW_AT_decl_line(0x56)
   11730                    .dwattr $C$DW$517, DW_AT_decl_column(0x16)
   11731            
   11732            $C$DW$518       .dwtag  DW_TAG_member
   11733                    .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$10)
   11734                    .dwattr $C$DW$518, DW_AT_name("rem")
   11735                    .dwattr $C$DW$518, DW_AT_TI_symbol_name("rem")
   11736                    .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11737                    .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
   11738                    .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
   11739                    .dwattr $C$DW$518, DW_AT_decl_line(0x56)
   11740                    .dwattr $C$DW$518, DW_AT_decl_column(0x1c)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  278

   11741            
   11742                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   11743                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x56)
   11744                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
   11745                    .dwendtag $C$DW$T$40
   11746            
   11747            $C$DW$T$65      .dwtag  DW_TAG_typedef
   11748                    .dwattr $C$DW$T$65, DW_AT_name("div_t")
   11749                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$40)
   11750                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
   11751                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   11752                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x56)
   11753                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x23)
   11754            
   11755            
   11756            $C$DW$T$41      .dwtag  DW_TAG_structure_type
   11757                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
   11758            $C$DW$519       .dwtag  DW_TAG_member
   11759                    .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$12)
   11760                    .dwattr $C$DW$519, DW_AT_name("quot")
   11761                    .dwattr $C$DW$519, DW_AT_TI_symbol_name("quot")
   11762                    .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11763                    .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
   11764                    .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
   11765                    .dwattr $C$DW$519, DW_AT_decl_line(0x59)
   11766                    .dwattr $C$DW$519, DW_AT_decl_column(0x17)
   11767            
   11768            $C$DW$520       .dwtag  DW_TAG_member
   11769                    .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$12)
   11770                    .dwattr $C$DW$520, DW_AT_name("rem")
   11771                    .dwattr $C$DW$520, DW_AT_TI_symbol_name("rem")
   11772                    .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11773                    .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
   11774                    .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
   11775                    .dwattr $C$DW$520, DW_AT_decl_line(0x59)
   11776                    .dwattr $C$DW$520, DW_AT_decl_column(0x1d)
   11777            
   11778                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   11779                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x59)
   11780                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
   11781                    .dwendtag $C$DW$T$41
   11782            
   11783            $C$DW$T$66      .dwtag  DW_TAG_typedef
   11784                    .dwattr $C$DW$T$66, DW_AT_name("ldiv_t")
   11785                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$41)
   11786                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   11787                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   11788                    .dwattr $C$DW$T$66, DW_AT_decl_line(0x59)
   11789                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x24)
   11790            
   11791            
   11792            $C$DW$T$42      .dwtag  DW_TAG_structure_type
   11793                    .dwattr $C$DW$T$42, DW_AT_byte_size(0x10)
   11794            $C$DW$521       .dwtag  DW_TAG_member
   11795                    .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$14)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  279

   11796                    .dwattr $C$DW$521, DW_AT_name("quot")
   11797                    .dwattr $C$DW$521, DW_AT_TI_symbol_name("quot")
   11798                    .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11799                    .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
   11800                    .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
   11801                    .dwattr $C$DW$521, DW_AT_decl_line(0x63)
   11802                    .dwattr $C$DW$521, DW_AT_decl_column(0x1c)
   11803            
   11804            $C$DW$522       .dwtag  DW_TAG_member
   11805                    .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$14)
   11806                    .dwattr $C$DW$522, DW_AT_name("rem")
   11807                    .dwattr $C$DW$522, DW_AT_TI_symbol_name("rem")
   11808                    .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11809                    .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
   11810                    .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
   11811                    .dwattr $C$DW$522, DW_AT_decl_line(0x63)
   11812                    .dwattr $C$DW$522, DW_AT_decl_column(0x22)
   11813            
   11814                    .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   11815                    .dwattr $C$DW$T$42, DW_AT_decl_line(0x63)
   11816                    .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
   11817                    .dwendtag $C$DW$T$42
   11818            
   11819            $C$DW$T$67      .dwtag  DW_TAG_typedef
   11820                    .dwattr $C$DW$T$67, DW_AT_name("lldiv_t")
   11821                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$42)
   11822                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   11823                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   11824                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x63)
   11825                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x29)
   11826            
   11827            
   11828            $C$DW$T$47      .dwtag  DW_TAG_union_type
   11829                    .dwattr $C$DW$T$47, DW_AT_byte_size(0x0c)
   11830            $C$DW$523       .dwtag  DW_TAG_member
   11831                    .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$23)
   11832                    .dwattr $C$DW$523, DW_AT_name("ERR")
   11833                    .dwattr $C$DW$523, DW_AT_TI_symbol_name("ERR")
   11834                    .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11835                    .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
   11836                    .dwattr $C$DW$523, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11837                    .dwattr $C$DW$523, DW_AT_decl_line(0x6e)
   11838                    .dwattr $C$DW$523, DW_AT_decl_column(0x15)
   11839            
   11840            $C$DW$524       .dwtag  DW_TAG_member
   11841                    .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$43)
   11842                    .dwattr $C$DW$524, DW_AT_name("CLOCK")
   11843                    .dwattr $C$DW$524, DW_AT_TI_symbol_name("CLOCK")
   11844                    .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11845                    .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
   11846                    .dwattr $C$DW$524, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11847                    .dwattr $C$DW$524, DW_AT_decl_line(0x70)
   11848                    .dwattr $C$DW$524, DW_AT_decl_column(0x15)
   11849            
   11850            $C$DW$525       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  280

   11851                    .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$44)
   11852                    .dwattr $C$DW$525, DW_AT_name("HELP")
   11853                    .dwattr $C$DW$525, DW_AT_TI_symbol_name("HELP")
   11854                    .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11855                    .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
   11856                    .dwattr $C$DW$525, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11857                    .dwattr $C$DW$525, DW_AT_decl_line(0x72)
   11858                    .dwattr $C$DW$525, DW_AT_decl_column(0x15)
   11859            
   11860            $C$DW$526       .dwtag  DW_TAG_member
   11861                    .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$44)
   11862                    .dwattr $C$DW$526, DW_AT_name("STATUS")
   11863                    .dwattr $C$DW$526, DW_AT_TI_symbol_name("STATUS")
   11864                    .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11865                    .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
   11866                    .dwattr $C$DW$526, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11867                    .dwattr $C$DW$526, DW_AT_decl_line(0x73)
   11868                    .dwattr $C$DW$526, DW_AT_decl_column(0x15)
   11869            
   11870            $C$DW$527       .dwtag  DW_TAG_member
   11871                    .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$44)
   11872                    .dwattr $C$DW$527, DW_AT_name("GATTEN")
   11873                    .dwattr $C$DW$527, DW_AT_TI_symbol_name("GATTEN")
   11874                    .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11875                    .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
   11876                    .dwattr $C$DW$527, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11877                    .dwattr $C$DW$527, DW_AT_decl_line(0x74)
   11878                    .dwattr $C$DW$527, DW_AT_decl_column(0x15)
   11879            
   11880            $C$DW$528       .dwtag  DW_TAG_member
   11881                    .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$44)
   11882                    .dwattr $C$DW$528, DW_AT_name("GGAIN")
   11883                    .dwattr $C$DW$528, DW_AT_TI_symbol_name("GGAIN")
   11884                    .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11885                    .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
   11886                    .dwattr $C$DW$528, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11887                    .dwattr $C$DW$528, DW_AT_decl_line(0x75)
   11888                    .dwattr $C$DW$528, DW_AT_decl_column(0x15)
   11889            
   11890            $C$DW$529       .dwtag  DW_TAG_member
   11891                    .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$44)
   11892                    .dwattr $C$DW$529, DW_AT_name("GPGAIN")
   11893                    .dwattr $C$DW$529, DW_AT_TI_symbol_name("GPGAIN")
   11894                    .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11895                    .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
   11896                    .dwattr $C$DW$529, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11897                    .dwattr $C$DW$529, DW_AT_decl_line(0x76)
   11898                    .dwattr $C$DW$529, DW_AT_decl_column(0x15)
   11899            
   11900            $C$DW$530       .dwtag  DW_TAG_member
   11901                    .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$44)
   11902                    .dwattr $C$DW$530, DW_AT_name("FLOOD")
   11903                    .dwattr $C$DW$530, DW_AT_TI_symbol_name("FLOOD")
   11904                    .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11905                    .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  281

   11906                    .dwattr $C$DW$530, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11907                    .dwattr $C$DW$530, DW_AT_decl_line(0x77)
   11908                    .dwattr $C$DW$530, DW_AT_decl_column(0x15)
   11909            
   11910            $C$DW$531       .dwtag  DW_TAG_member
   11911                    .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$45)
   11912                    .dwattr $C$DW$531, DW_AT_name("SGAIN")
   11913                    .dwattr $C$DW$531, DW_AT_TI_symbol_name("SGAIN")
   11914                    .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11915                    .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
   11916                    .dwattr $C$DW$531, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11917                    .dwattr $C$DW$531, DW_AT_decl_line(0x79)
   11918                    .dwattr $C$DW$531, DW_AT_decl_column(0x15)
   11919            
   11920            $C$DW$532       .dwtag  DW_TAG_member
   11921                    .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$45)
   11922                    .dwattr $C$DW$532, DW_AT_name("SPGAIN")
   11923                    .dwattr $C$DW$532, DW_AT_TI_symbol_name("SPGAIN")
   11924                    .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11925                    .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
   11926                    .dwattr $C$DW$532, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11927                    .dwattr $C$DW$532, DW_AT_decl_line(0x7a)
   11928                    .dwattr $C$DW$532, DW_AT_decl_column(0x15)
   11929            
   11930            $C$DW$533       .dwtag  DW_TAG_member
   11931                    .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$45)
   11932                    .dwattr $C$DW$533, DW_AT_name("SATTEN")
   11933                    .dwattr $C$DW$533, DW_AT_TI_symbol_name("SATTEN")
   11934                    .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11935                    .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
   11936                    .dwattr $C$DW$533, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11937                    .dwattr $C$DW$533, DW_AT_decl_line(0x7b)
   11938                    .dwattr $C$DW$533, DW_AT_decl_column(0x15)
   11939            
   11940            $C$DW$534       .dwtag  DW_TAG_member
   11941                    .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$46)
   11942                    .dwattr $C$DW$534, DW_AT_name("RUN")
   11943                    .dwattr $C$DW$534, DW_AT_TI_symbol_name("RUN")
   11944                    .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11945                    .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
   11946                    .dwattr $C$DW$534, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11947                    .dwattr $C$DW$534, DW_AT_decl_line(0x7d)
   11948                    .dwattr $C$DW$534, DW_AT_decl_column(0x15)
   11949            
   11950            $C$DW$535       .dwtag  DW_TAG_member
   11951                    .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$46)
   11952                    .dwattr $C$DW$535, DW_AT_name("SPOOF")
   11953                    .dwattr $C$DW$535, DW_AT_TI_symbol_name("SPOOF")
   11954                    .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11955                    .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
   11956                    .dwattr $C$DW$535, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
   11957                    .dwattr $C$DW$535, DW_AT_decl_line(0x7e)
   11958                    .dwattr $C$DW$535, DW_AT_decl_column(0x15)
   11959            
   11960                    .dwattr $C$DW$T$47, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  282

   11961                    .dwattr $C$DW$T$47, DW_AT_decl_line(0x6d)
   11962                    .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
   11963                    .dwendtag $C$DW$T$47
   11964            
   11965            $C$DW$T$32      .dwtag  DW_TAG_typedef
   11966                    .dwattr $C$DW$T$32, DW_AT_name("CMD_CommandData")
   11967                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$47)
   11968                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
   11969                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
   11970                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x80)
   11971                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
   11972            
   11973            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
   11974                    .dwattr $C$DW$T$2, DW_AT_name("void")
   11975            
   11976            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
   11977                    .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
   11978                    .dwattr $C$DW$T$3, DW_AT_address_class(0x14)
   11979            
   11980            
   11981            $C$DW$T$68      .dwtag  DW_TAG_subroutine_type
   11982                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   11983                    .dwendtag $C$DW$T$68
   11984            
   11985            $C$DW$T$69      .dwtag  DW_TAG_pointer_type
   11986                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
   11987                    .dwattr $C$DW$T$69, DW_AT_address_class(0x14)
   11988            
   11989            $C$DW$T$70      .dwtag  DW_TAG_typedef
   11990                    .dwattr $C$DW$T$70, DW_AT_name("__TI_atexit_fn")
   11991                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
   11992                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
   11993                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   11994                    .dwattr $C$DW$T$70, DW_AT_decl_line(0xcf)
   11995                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x14)
   11996            
   11997            
   11998            $C$DW$T$77      .dwtag  DW_TAG_subroutine_type
   11999                    .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
   12000                    .dwendtag $C$DW$T$77
   12001            
   12002            $C$DW$T$78      .dwtag  DW_TAG_pointer_type
   12003                    .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
   12004                    .dwattr $C$DW$T$78, DW_AT_address_class(0x14)
   12005            
   12006            $C$DW$T$79      .dwtag  DW_TAG_typedef
   12007                    .dwattr $C$DW$T$79, DW_AT_name("__SFR_FARPTR")
   12008                    .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
   12009                    .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
   12010                    .dwattr $C$DW$T$79, DW_AT_decl_file("C:\ti\ccs1250\ccs\ccs_base\msp430\include\msp430fg6626.h"
   12011                    .dwattr $C$DW$T$79, DW_AT_decl_line(0x46)
   12012                    .dwattr $C$DW$T$79, DW_AT_decl_column(0x11)
   12013            
   12014            $C$DW$536       .dwtag  DW_TAG_TI_far_type
   12015                    .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$2)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  283

   12016            
   12017            $C$DW$T$80      .dwtag  DW_TAG_const_type
   12018                    .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$536)
   12019            
   12020            $C$DW$T$81      .dwtag  DW_TAG_pointer_type
   12021                    .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
   12022                    .dwattr $C$DW$T$81, DW_AT_address_class(0x14)
   12023            
   12024            $C$DW$T$4       .dwtag  DW_TAG_base_type
   12025                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
   12026                    .dwattr $C$DW$T$4, DW_AT_name("bool")
   12027                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
   12028            
   12029            $C$DW$T$5       .dwtag  DW_TAG_base_type
   12030                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
   12031                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
   12032                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
   12033            
   12034            $C$DW$T$82      .dwtag  DW_TAG_typedef
   12035                    .dwattr $C$DW$T$82, DW_AT_name("__int8_t")
   12036                    .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$5)
   12037                    .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   12038                    .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12039                    .dwattr $C$DW$T$82, DW_AT_decl_line(0x36)
   12040                    .dwattr $C$DW$T$82, DW_AT_decl_column(0x16)
   12041            
   12042            $C$DW$T$83      .dwtag  DW_TAG_typedef
   12043                    .dwattr $C$DW$T$83, DW_AT_name("__int_least8_t")
   12044                    .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
   12045                    .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
   12046                    .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12047                    .dwattr $C$DW$T$83, DW_AT_decl_line(0x5a)
   12048                    .dwattr $C$DW$T$83, DW_AT_decl_column(0x12)
   12049            
   12050            $C$DW$T$84      .dwtag  DW_TAG_typedef
   12051                    .dwattr $C$DW$T$84, DW_AT_name("int_least8_t")
   12052                    .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
   12053                    .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
   12054                    .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12055                    .dwattr $C$DW$T$84, DW_AT_decl_line(0x2a)
   12056                    .dwattr $C$DW$T$84, DW_AT_decl_column(0x19)
   12057            
   12058            $C$DW$T$85      .dwtag  DW_TAG_typedef
   12059                    .dwattr $C$DW$T$85, DW_AT_name("int8_t")
   12060                    .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$82)
   12061                    .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
   12062                    .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12063                    .dwattr $C$DW$T$85, DW_AT_decl_line(0x25)
   12064                    .dwattr $C$DW$T$85, DW_AT_decl_column(0x13)
   12065            
   12066            $C$DW$T$6       .dwtag  DW_TAG_base_type
   12067                    .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
   12068                    .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
   12069                    .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
   12070            
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  284

   12071            $C$DW$T$48      .dwtag  DW_TAG_pointer_type
   12072                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$6)
   12073                    .dwattr $C$DW$T$48, DW_AT_address_class(0x14)
   12074            
   12075            $C$DW$537       .dwtag  DW_TAG_TI_far_type
   12076                    .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$6)
   12077            
   12078            $C$DW$T$86      .dwtag  DW_TAG_volatile_type
   12079                    .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$537)
   12080            
   12081            $C$DW$T$36      .dwtag  DW_TAG_typedef
   12082                    .dwattr $C$DW$T$36, DW_AT_name("__uint8_t")
   12083                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$6)
   12084                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
   12085                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12086                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x37)
   12087                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x18)
   12088            
   12089            $C$DW$T$93      .dwtag  DW_TAG_typedef
   12090                    .dwattr $C$DW$T$93, DW_AT_name("__sa_family_t")
   12091                    .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$36)
   12092                    .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   12093                    .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12094                    .dwattr $C$DW$T$93, DW_AT_decl_line(0x47)
   12095                    .dwattr $C$DW$T$93, DW_AT_decl_column(0x13)
   12096            
   12097            $C$DW$T$94      .dwtag  DW_TAG_typedef
   12098                    .dwattr $C$DW$T$94, DW_AT_name("__uint_least8_t")
   12099                    .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$36)
   12100                    .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
   12101                    .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12102                    .dwattr $C$DW$T$94, DW_AT_decl_line(0x74)
   12103                    .dwattr $C$DW$T$94, DW_AT_decl_column(0x13)
   12104            
   12105            $C$DW$T$95      .dwtag  DW_TAG_typedef
   12106                    .dwattr $C$DW$T$95, DW_AT_name("uint_least8_t")
   12107                    .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   12108                    .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   12109                    .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12110                    .dwattr $C$DW$T$95, DW_AT_decl_line(0x2f)
   12111                    .dwattr $C$DW$T$95, DW_AT_decl_column(0x1a)
   12112            
   12113            $C$DW$T$37      .dwtag  DW_TAG_typedef
   12114                    .dwattr $C$DW$T$37, DW_AT_name("uint8_t")
   12115                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
   12116                    .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
   12117                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12118                    .dwattr $C$DW$T$37, DW_AT_decl_line(0x3b)
   12119                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x14)
   12120            
   12121            $C$DW$T$7       .dwtag  DW_TAG_base_type
   12122                    .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
   12123                    .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
   12124                    .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
   12125            
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  285

   12126            $C$DW$T$8       .dwtag  DW_TAG_base_type
   12127                    .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
   12128                    .dwattr $C$DW$T$8, DW_AT_name("short")
   12129                    .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
   12130            
   12131            $C$DW$T$9       .dwtag  DW_TAG_base_type
   12132                    .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
   12133                    .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
   12134                    .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
   12135            
   12136            $C$DW$T$10      .dwtag  DW_TAG_base_type
   12137                    .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
   12138                    .dwattr $C$DW$T$10, DW_AT_name("int")
   12139                    .dwattr $C$DW$T$10, DW_AT_byte_size(0x02)
   12140            
   12141            $C$DW$T$96      .dwtag  DW_TAG_typedef
   12142                    .dwattr $C$DW$T$96, DW_AT_name("_Mbstatet")
   12143                    .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$10)
   12144                    .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
   12145                    .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12146                    .dwattr $C$DW$T$96, DW_AT_decl_line(0x8f)
   12147                    .dwattr $C$DW$T$96, DW_AT_decl_column(0x0d)
   12148            
   12149            $C$DW$T$97      .dwtag  DW_TAG_typedef
   12150                    .dwattr $C$DW$T$97, DW_AT_name("__mbstate_t")
   12151                    .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
   12152                    .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   12153                    .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12154                    .dwattr $C$DW$T$97, DW_AT_decl_line(0x92)
   12155                    .dwattr $C$DW$T$97, DW_AT_decl_column(0x13)
   12156            
   12157            $C$DW$T$98      .dwtag  DW_TAG_typedef
   12158                    .dwattr $C$DW$T$98, DW_AT_name("__accmode_t")
   12159                    .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$10)
   12160                    .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
   12161                    .dwattr $C$DW$T$98, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12162                    .dwattr $C$DW$T$98, DW_AT_decl_line(0x3b)
   12163                    .dwattr $C$DW$T$98, DW_AT_decl_column(0x0e)
   12164            
   12165            
   12166            $C$DW$T$110     .dwtag  DW_TAG_subroutine_type
   12167                    .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$10)
   12168                    .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
   12169            $C$DW$538       .dwtag  DW_TAG_formal_parameter
   12170                    .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$81)
   12171            
   12172            $C$DW$539       .dwtag  DW_TAG_formal_parameter
   12173                    .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$81)
   12174            
   12175                    .dwendtag $C$DW$T$110
   12176            
   12177            $C$DW$T$111     .dwtag  DW_TAG_pointer_type
   12178                    .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
   12179                    .dwattr $C$DW$T$111, DW_AT_address_class(0x14)
   12180            
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  286

   12181            $C$DW$T$112     .dwtag  DW_TAG_typedef
   12182                    .dwattr $C$DW$T$112, DW_AT_name("__TI_compar_fn")
   12183                    .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
   12184                    .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
   12185                    .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12186                    .dwattr $C$DW$T$112, DW_AT_decl_line(0xd2)
   12187                    .dwattr $C$DW$T$112, DW_AT_decl_column(0x13)
   12188            
   12189            $C$DW$T$117     .dwtag  DW_TAG_typedef
   12190                    .dwattr $C$DW$T$117, DW_AT_name("__cpulevel_t")
   12191                    .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$10)
   12192                    .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
   12193                    .dwattr $C$DW$T$117, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12194                    .dwattr $C$DW$T$117, DW_AT_decl_line(0x50)
   12195                    .dwattr $C$DW$T$117, DW_AT_decl_column(0x0e)
   12196            
   12197            $C$DW$T$118     .dwtag  DW_TAG_typedef
   12198                    .dwattr $C$DW$T$118, DW_AT_name("__cpusetid_t")
   12199                    .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$10)
   12200                    .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
   12201                    .dwattr $C$DW$T$118, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12202                    .dwattr $C$DW$T$118, DW_AT_decl_line(0x51)
   12203                    .dwattr $C$DW$T$118, DW_AT_decl_column(0x0e)
   12204            
   12205            $C$DW$T$119     .dwtag  DW_TAG_typedef
   12206                    .dwattr $C$DW$T$119, DW_AT_name("__cpuwhich_t")
   12207                    .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$10)
   12208                    .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
   12209                    .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12210                    .dwattr $C$DW$T$119, DW_AT_decl_line(0x4f)
   12211                    .dwattr $C$DW$T$119, DW_AT_decl_column(0x0e)
   12212            
   12213            $C$DW$T$120     .dwtag  DW_TAG_typedef
   12214                    .dwattr $C$DW$T$120, DW_AT_name("__ct_rune_t")
   12215                    .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$10)
   12216                    .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
   12217                    .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12218                    .dwattr $C$DW$T$120, DW_AT_decl_line(0x69)
   12219                    .dwattr $C$DW$T$120, DW_AT_decl_column(0x0e)
   12220            
   12221            $C$DW$T$121     .dwtag  DW_TAG_typedef
   12222                    .dwattr $C$DW$T$121, DW_AT_name("__rune_t")
   12223                    .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
   12224                    .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
   12225                    .dwattr $C$DW$T$121, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12226                    .dwattr $C$DW$T$121, DW_AT_decl_line(0x6c)
   12227                    .dwattr $C$DW$T$121, DW_AT_decl_column(0x15)
   12228            
   12229            $C$DW$T$122     .dwtag  DW_TAG_typedef
   12230                    .dwattr $C$DW$T$122, DW_AT_name("__wint_t")
   12231                    .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$120)
   12232                    .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
   12233                    .dwattr $C$DW$T$122, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12234                    .dwattr $C$DW$T$122, DW_AT_decl_line(0x6d)
   12235                    .dwattr $C$DW$T$122, DW_AT_decl_column(0x15)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  287

   12236            
   12237            $C$DW$T$123     .dwtag  DW_TAG_typedef
   12238                    .dwattr $C$DW$T$123, DW_AT_name("__int16_t")
   12239                    .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$10)
   12240                    .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
   12241                    .dwattr $C$DW$T$123, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12242                    .dwattr $C$DW$T$123, DW_AT_decl_line(0x38)
   12243                    .dwattr $C$DW$T$123, DW_AT_decl_column(0x0f)
   12244            
   12245            $C$DW$T$124     .dwtag  DW_TAG_typedef
   12246                    .dwattr $C$DW$T$124, DW_AT_name("__int_fast16_t")
   12247                    .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
   12248                    .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
   12249                    .dwattr $C$DW$T$124, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12250                    .dwattr $C$DW$T$124, DW_AT_decl_line(0x57)
   12251                    .dwattr $C$DW$T$124, DW_AT_decl_column(0x13)
   12252            
   12253            $C$DW$T$125     .dwtag  DW_TAG_typedef
   12254                    .dwattr $C$DW$T$125, DW_AT_name("int_fast16_t")
   12255                    .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
   12256                    .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
   12257                    .dwattr $C$DW$T$125, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12258                    .dwattr $C$DW$T$125, DW_AT_decl_line(0x35)
   12259                    .dwattr $C$DW$T$125, DW_AT_decl_column(0x19)
   12260            
   12261            $C$DW$T$126     .dwtag  DW_TAG_typedef
   12262                    .dwattr $C$DW$T$126, DW_AT_name("__int_fast8_t")
   12263                    .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$123)
   12264                    .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
   12265                    .dwattr $C$DW$T$126, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12266                    .dwattr $C$DW$T$126, DW_AT_decl_line(0x56)
   12267                    .dwattr $C$DW$T$126, DW_AT_decl_column(0x13)
   12268            
   12269            $C$DW$T$127     .dwtag  DW_TAG_typedef
   12270                    .dwattr $C$DW$T$127, DW_AT_name("int_fast8_t")
   12271                    .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
   12272                    .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
   12273                    .dwattr $C$DW$T$127, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12274                    .dwattr $C$DW$T$127, DW_AT_decl_line(0x34)
   12275                    .dwattr $C$DW$T$127, DW_AT_decl_column(0x18)
   12276            
   12277            $C$DW$T$128     .dwtag  DW_TAG_typedef
   12278                    .dwattr $C$DW$T$128, DW_AT_name("__int_least16_t")
   12279                    .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$123)
   12280                    .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
   12281                    .dwattr $C$DW$T$128, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12282                    .dwattr $C$DW$T$128, DW_AT_decl_line(0x5b)
   12283                    .dwattr $C$DW$T$128, DW_AT_decl_column(0x13)
   12284            
   12285            $C$DW$T$129     .dwtag  DW_TAG_typedef
   12286                    .dwattr $C$DW$T$129, DW_AT_name("int_least16_t")
   12287                    .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
   12288                    .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
   12289                    .dwattr $C$DW$T$129, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12290                    .dwattr $C$DW$T$129, DW_AT_decl_line(0x2b)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  288

   12291                    .dwattr $C$DW$T$129, DW_AT_decl_column(0x1a)
   12292            
   12293            $C$DW$T$130     .dwtag  DW_TAG_typedef
   12294                    .dwattr $C$DW$T$130, DW_AT_name("__register_t")
   12295                    .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$123)
   12296                    .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
   12297                    .dwattr $C$DW$T$130, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12298                    .dwattr $C$DW$T$130, DW_AT_decl_line(0x5f)
   12299                    .dwattr $C$DW$T$130, DW_AT_decl_column(0x13)
   12300            
   12301            $C$DW$T$131     .dwtag  DW_TAG_typedef
   12302                    .dwattr $C$DW$T$131, DW_AT_name("int16_t")
   12303                    .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$123)
   12304                    .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
   12305                    .dwattr $C$DW$T$131, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12306                    .dwattr $C$DW$T$131, DW_AT_decl_line(0x2b)
   12307                    .dwattr $C$DW$T$131, DW_AT_decl_column(0x14)
   12308            
   12309            $C$DW$540       .dwtag  DW_TAG_TI_far_type
   12310                    .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$131)
   12311            
   12312            $C$DW$T$132     .dwtag  DW_TAG_const_type
   12313                    .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$540)
   12314            
   12315            
   12316            $C$DW$T$133     .dwtag  DW_TAG_array_type
   12317                    .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
   12318                    .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
   12319                    .dwattr $C$DW$T$133, DW_AT_byte_size(0x20)
   12320            $C$DW$541       .dwtag  DW_TAG_subrange_type
   12321                    .dwattr $C$DW$541, DW_AT_upper_bound(0x0f)
   12322            
   12323                    .dwendtag $C$DW$T$133
   12324            
   12325            $C$DW$542       .dwtag  DW_TAG_TI_far_type
   12326                    .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$131)
   12327            
   12328            $C$DW$T$134     .dwtag  DW_TAG_volatile_type
   12329                    .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$542)
   12330            
   12331            
   12332            $C$DW$T$135     .dwtag  DW_TAG_array_type
   12333                    .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
   12334                    .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
   12335                    .dwattr $C$DW$T$135, DW_AT_byte_size(0x400)
   12336            $C$DW$543       .dwtag  DW_TAG_subrange_type
   12337                    .dwattr $C$DW$543, DW_AT_upper_bound(0x1ff)
   12338            
   12339                    .dwendtag $C$DW$T$135
   12340            
   12341            $C$DW$T$136     .dwtag  DW_TAG_typedef
   12342                    .dwattr $C$DW$T$136, DW_AT_name("__nl_item")
   12343                    .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$10)
   12344                    .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
   12345                    .dwattr $C$DW$T$136, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  289

   12346                    .dwattr $C$DW$T$136, DW_AT_decl_line(0x3c)
   12347                    .dwattr $C$DW$T$136, DW_AT_decl_column(0x0e)
   12348            
   12349            $C$DW$T$137     .dwtag  DW_TAG_typedef
   12350                    .dwattr $C$DW$T$137, DW_AT_name("__ptrdiff_t")
   12351                    .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$10)
   12352                    .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
   12353                    .dwattr $C$DW$T$137, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12354                    .dwattr $C$DW$T$137, DW_AT_decl_line(0x5e)
   12355                    .dwattr $C$DW$T$137, DW_AT_decl_column(0x1c)
   12356            
   12357            $C$DW$T$11      .dwtag  DW_TAG_base_type
   12358                    .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
   12359                    .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
   12360                    .dwattr $C$DW$T$11, DW_AT_byte_size(0x02)
   12361            
   12362            $C$DW$T$138     .dwtag  DW_TAG_typedef
   12363                    .dwattr $C$DW$T$138, DW_AT_name("___wchar_t")
   12364                    .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$11)
   12365                    .dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
   12366                    .dwattr $C$DW$T$138, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12367                    .dwattr $C$DW$T$138, DW_AT_decl_line(0x7d)
   12368                    .dwattr $C$DW$T$138, DW_AT_decl_column(0x1a)
   12369            
   12370            $C$DW$544       .dwtag  DW_TAG_TI_far_type
   12371                    .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$11)
   12372            
   12373            $C$DW$T$141     .dwtag  DW_TAG_volatile_type
   12374                    .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$544)
   12375            
   12376            $C$DW$T$157     .dwtag  DW_TAG_typedef
   12377                    .dwattr $C$DW$T$157, DW_AT_name("__size_t")
   12378                    .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$11)
   12379                    .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
   12380                    .dwattr $C$DW$T$157, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12381                    .dwattr $C$DW$T$157, DW_AT_decl_line(0x61)
   12382                    .dwattr $C$DW$T$157, DW_AT_decl_column(0x19)
   12383            
   12384            $C$DW$T$22      .dwtag  DW_TAG_typedef
   12385                    .dwattr $C$DW$T$22, DW_AT_name("__uint16_t")
   12386                    .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$11)
   12387                    .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
   12388                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12389                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x39)
   12390                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x17)
   12391            
   12392            $C$DW$T$158     .dwtag  DW_TAG_typedef
   12393                    .dwattr $C$DW$T$158, DW_AT_name("__mode_t")
   12394                    .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$22)
   12395                    .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
   12396                    .dwattr $C$DW$T$158, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12397                    .dwattr $C$DW$T$158, DW_AT_decl_line(0x3a)
   12398                    .dwattr $C$DW$T$158, DW_AT_decl_column(0x14)
   12399            
   12400            $C$DW$T$159     .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  290

   12401                    .dwattr $C$DW$T$159, DW_AT_name("__u_register_t")
   12402                    .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$22)
   12403                    .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
   12404                    .dwattr $C$DW$T$159, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12405                    .dwattr $C$DW$T$159, DW_AT_decl_line(0x78)
   12406                    .dwattr $C$DW$T$159, DW_AT_decl_column(0x14)
   12407            
   12408            $C$DW$T$160     .dwtag  DW_TAG_typedef
   12409                    .dwattr $C$DW$T$160, DW_AT_name("__uint_fast16_t")
   12410                    .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$22)
   12411                    .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
   12412                    .dwattr $C$DW$T$160, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12413                    .dwattr $C$DW$T$160, DW_AT_decl_line(0x71)
   12414                    .dwattr $C$DW$T$160, DW_AT_decl_column(0x14)
   12415            
   12416            $C$DW$T$161     .dwtag  DW_TAG_typedef
   12417                    .dwattr $C$DW$T$161, DW_AT_name("uint_fast16_t")
   12418                    .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$160)
   12419                    .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
   12420                    .dwattr $C$DW$T$161, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12421                    .dwattr $C$DW$T$161, DW_AT_decl_line(0x3a)
   12422                    .dwattr $C$DW$T$161, DW_AT_decl_column(0x1a)
   12423            
   12424            $C$DW$T$162     .dwtag  DW_TAG_typedef
   12425                    .dwattr $C$DW$T$162, DW_AT_name("__uint_fast8_t")
   12426                    .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$22)
   12427                    .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
   12428                    .dwattr $C$DW$T$162, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12429                    .dwattr $C$DW$T$162, DW_AT_decl_line(0x70)
   12430                    .dwattr $C$DW$T$162, DW_AT_decl_column(0x14)
   12431            
   12432            $C$DW$T$163     .dwtag  DW_TAG_typedef
   12433                    .dwattr $C$DW$T$163, DW_AT_name("uint_fast8_t")
   12434                    .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
   12435                    .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
   12436                    .dwattr $C$DW$T$163, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12437                    .dwattr $C$DW$T$163, DW_AT_decl_line(0x39)
   12438                    .dwattr $C$DW$T$163, DW_AT_decl_column(0x19)
   12439            
   12440            $C$DW$T$164     .dwtag  DW_TAG_typedef
   12441                    .dwattr $C$DW$T$164, DW_AT_name("__uint_least16_t")
   12442                    .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$22)
   12443                    .dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
   12444                    .dwattr $C$DW$T$164, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12445                    .dwattr $C$DW$T$164, DW_AT_decl_line(0x75)
   12446                    .dwattr $C$DW$T$164, DW_AT_decl_column(0x14)
   12447            
   12448            $C$DW$T$165     .dwtag  DW_TAG_typedef
   12449                    .dwattr $C$DW$T$165, DW_AT_name("__char16_t")
   12450                    .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
   12451                    .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
   12452                    .dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12453                    .dwattr $C$DW$T$165, DW_AT_decl_line(0x71)
   12454                    .dwattr $C$DW$T$165, DW_AT_decl_column(0x1a)
   12455            
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:58 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE  291

   12456            $C$DW$T$166     .dwtag  DW_TAG_typedef
   12457                    .dwattr $C$DW$T$166, DW_AT_name("uint_least16_t")
   12458                    .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$164)
   12459                    .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
   12460                    .dwattr $C$DW$T$166, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
   12461                    .dwattr $C$DW$T$166, DW_AT_decl_line(0x30)
   12462                    .dwattr $C$DW$T$166, DW_AT_decl_column(0x1a)
   12463            
   12464            $C$DW$T$23      .dwtag  DW_TAG_typedef
   12465                    .dwattr $C$DW$T$23, DW_AT_name("uint16_t")
   12466                    .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
   12467                    .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
   12468                    .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   12469                    .dwattr $C$DW$T$23, DW_AT_decl_line(0x41)
   12470                    .dwattr $C$DW$T$23, DW_AT_decl_column(0x15)
   12471            
   12472            
   12473            $C$DW$T$25      .dwtag  DW_TAG_array_type
   12474                    .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$23)
   12475                    .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
   12476                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x40)
   12477            $C$DW$545       .dwtag  DW_TAG_subrange_type
   12478                    .dwattr $C$DW$545, DW_AT_upper_bound(0x1f)
   12479            
   12480                    .dwendtag $C$DW$T$25
   12481            
   12482            $C$DW$546       .dwtag  DW_TAG_TI_far_type
   12483                    .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$23)
   12484            
   12485            $C$DW$T$172     .dwtag  DW_TAG_const_type
   12486                    .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$546)
   12487            
   12488            
   12489            $C$DW$T$173     .dwtag  DW_TAG_array_type
   12490                    .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$172)
   12491                    .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
   12492                    .dwattr $C$DW$T$173, DW_AT_byte_size(0x40)
   12493            $C$DW$547       .dwtag  DW_TAG_subrange_type
   12494                    .dwattr $C$DW$547, DW_AT_upper_bound(0x1f)
   12495            
