MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
bak.asm                                                              PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Mon Feb 24 13:22:57 2025                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/bak.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\Deb
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("BAKMEM0")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("BAKMEM0")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$92)

    1541                    .dwpsn  file "../src/bak.c",line 266,column 9,is_stmt,isa 0
    1542 00019c 431F          MOV.W     #1,r15                ; [] |266| 
    1543            ;* --------------------------------------------------------------------------*
    1544 00019e       $C$L55:    
    1545                    .dwpsn  file "../src/bak.c",line 116,column 9,is_stmt,isa 0
    1546 00019e 002E!         MOVX.A    &CH_Channels+16,r14   ; [] |116| 
         0001a0 0010 
    1547 0001a2 4F8E          MOV.W     r15,6(r14)            ; [] |116| 
         0001a4 0006 
    1548                    .dwpsn  file "../src/bak.c",line 118,column 9,is_stmt,isa 0
    1549 0001a6 4C4C          MOV.B     r12,r12               ; [] |118| 
    1550 0001a8 1944          RPT #5 || RRUX.W r12 ; [] |118| 
         0001aa 100C 
    1551 0001ac 422D          MOV.W     #4,r13                ; [] |118| 
    1552            $C$DW$82        .dwtag  DW_TAG_TI_branch
    1553                    .dwattr $C$DW$82, DW_AT_low_pc(0x00)
    1554                    .dwattr $C$DW$82, DW_AT_name("DecodePregain")
    1555                    .dwattr $C$DW$82, DW_AT_TI_call
    1556            
    1557 0001ae 13B0!         CALLA     #DecodePregain        ; [] |118| 
         0001b0 0000 
    1558                                                      ; [] |118| 
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
bak.asm                                                              PAGE   32

    1559 0001b2 002F!         MOVX.A    &CH_Channels+16,r15   ; [] |118| 
         0001b4 0010 
    1560 0001b6 4C8F          MOV.W     r12,4(r15)            ; [] |118| 
         0001b8 0004 
    1561                    .dwpsn  file "../src/bak.c",line 121,column 9,is_stmt,isa 0
    1562 0001ba 008C!         MOVX.A    #MAIN_CurrentTime+0,r12 ; [] |121| 
         0001bc 0000 
    1563            $C$DW$83        .dwtag  DW_TAG_TI_branch
    1564                    .dwattr $C$DW$83, DW_AT_low_pc(0x00)
    1565                    .dwattr $C$DW$83, DW_AT_name("CLK_GetRTC")
    1566                    .dwattr $C$DW$83, DW_AT_TI_call
    1567            
    1568 0001be 13B0!         CALLA     #CLK_GetRTC           ; [] |121| 
         0001c0 0000 
    1569                                                      ; [] |121| 
    1570                    .dwpsn  file "../src/bak.c",line 124,column 5,is_stmt,isa 0
    1571 0001c2 430C          MOV.W     #0,r12                ; [] |124| 
    1572            $C$DW$84        .dwtag  DW_TAG_TI_branch
    1573                    .dwattr $C$DW$84, DW_AT_low_pc(0x00)
    1574                    .dwattr $C$DW$84, DW_AT_TI_return
    1575            
    1576 0001c4 0110          RETA      ; [] 
    1577                    ; [] 
    1578                    .dwattr $C$DW$72, DW_AT_TI_end_file("../src/bak.c")
    1579                    .dwattr $C$DW$72, DW_AT_TI_end_line(0x7d)
    1580                    .dwattr $C$DW$72, DW_AT_TI_end_column(0x01)
    1581                    .dwendentry
    1582                    .dwendtag $C$DW$72
    1583            
    1584            ;*****************************************************************************
    1585            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1586            ;*****************************************************************************
    1587                    .global BAKMEM0
    1588                    .global BAKMEM1
    1589                    .global BAKMEM1_L
    1590                    .global BAKMEM1_H
    1591                    .global BAKMEM2
    1592                    .global BAKMEM2_L
    1593                    .global BAKMEM2_H
    1594                    .global BAKMEM3
    1595                    .global BAKMEM3_L
    1596                    .global BAKMEM3_H
    1597                    .global MAIN_CurrentTime
    1598                    .global CH_Channels
    1599                    .global CLK_GetRTC
    1600            
    1601            ;******************************************************************************
    1602            ;* BUILD ATTRIBUTES                                                           *
    1603            ;******************************************************************************
    1604                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
    1605                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111100000000
    1606                    .battr "TI", Tag_File, 1, Tag_LEA_INFO(1)
    1607                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
    1608                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    1609                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(2)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
bak.asm                                                              PAGE   33

    1610                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    1611            
    1612            ;******************************************************************************
    1613            ;* TYPE INFORMATION                                                           *
    1614            ;******************************************************************************
    1615            
    1616            $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1617                    .dwattr $C$DW$T$23, DW_AT_byte_size(0x0c)
    1618            $C$DW$85        .dwtag  DW_TAG_member
    1619                    .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$22)
    1620                    .dwattr $C$DW$85, DW_AT_name("year")
    1621                    .dwattr $C$DW$85, DW_AT_TI_symbol_name("year")
    1622                    .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1623                    .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1624                    .dwattr $C$DW$85, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\in
    1625                    .dwattr $C$DW$85, DW_AT_decl_line(0x2a)
    1626                    .dwattr $C$DW$85, DW_AT_decl_column(0x11)
    1627            
    1628            $C$DW$86        .dwtag  DW_TAG_member
    1629                    .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$22)
    1630                    .dwattr $C$DW$86, DW_AT_name("month")
    1631                    .dwattr $C$DW$86, DW_AT_TI_symbol_name("month")
    1632                    .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1633                    .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1634                    .dwattr $C$DW$86, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\in
    1635                    .dwattr $C$DW$86, DW_AT_decl_line(0x2b)
    1636                    .dwattr $C$DW$86, DW_AT_decl_column(0x11)
    1637            
    1638            $C$DW$87        .dwtag  DW_TAG_member
    1639                    .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$22)
    1640                    .dwattr $C$DW$87, DW_AT_name("day")
    1641                    .dwattr $C$DW$87, DW_AT_TI_symbol_name("day")
    1642                    .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1643                    .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1644                    .dwattr $C$DW$87, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\in
    1645                    .dwattr $C$DW$87, DW_AT_decl_line(0x2c)
    1646                    .dwattr $C$DW$87, DW_AT_decl_column(0x11)
    1647            
    1648            $C$DW$88        .dwtag  DW_TAG_member
    1649                    .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$22)
    1650                    .dwattr $C$DW$88, DW_AT_name("hour")
    1651                    .dwattr $C$DW$88, DW_AT_TI_symbol_name("hour")
    1652                    .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1653                    .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1654                    .dwattr $C$DW$88, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\in
    1655                    .dwattr $C$DW$88, DW_AT_decl_line(0x2d)
    1656                    .dwattr $C$DW$88, DW_AT_decl_column(0x11)
    1657            
    1658            $C$DW$89        .dwtag  DW_TAG_member
    1659                    .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$22)
    1660                    .dwattr $C$DW$89, DW_AT_name("min")
    1661                    .dwattr $C$DW$89, DW_AT_TI_symbol_name("min")
    1662                    .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1663                    .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1664                    .dwattr $C$DW$89, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\in
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
bak.asm                                                              PAGE   34

    1665                    .dwattr $C$DW$89, DW_AT_decl_line(0x2e)
    1666                    .dwattr $C$DW$89, DW_AT_decl_column(0x11)
    1667            
    1668            $C$DW$90        .dwtag  DW_TAG_member
    1669                    .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$22)
    1670                    .dwattr $C$DW$90, DW_AT_name("sec")
    1671                    .dwattr $C$DW$90, DW_AT_TI_symbol_name("sec")
    1672                    .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1673                    .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1674                    .dwattr $C$DW$90, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\in
    1675                    .dwattr $C$DW$90, DW_AT_decl_line(0x2f)
    1676                    .dwattr $C$DW$90, DW_AT_decl_column(0x11)
    1677            
    1678                    .dwattr $C$DW$T$23, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\
    1679                    .dwattr $C$DW$T$23, DW_AT_decl_line(0x29)
    1680                    .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    1681                    .dwendtag $C$DW$T$23
    1682            
    1683            $C$DW$T$32      .dwtag  DW_TAG_typedef
    1684                    .dwattr $C$DW$T$32, DW_AT_name("CLK_TimeStamp")
    1685                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$23)
    1686                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1687                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\
    1688                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x30)
    1689                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    1690            
    1691            $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1692                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1693                    .dwattr $C$DW$T$33, DW_AT_address_class(0x14)
    1694            
    1695            
    1696            $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1697                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x6a)
    1698            $C$DW$91        .dwtag  DW_TAG_member
    1699                    .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$22)
    1700                    .dwattr $C$DW$91, DW_AT_name("id")
    1701                    .dwattr $C$DW$91, DW_AT_TI_symbol_name("id")
    1702                    .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1703                    .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1704                    .dwattr $C$DW$91, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
    1705                    .dwattr $C$DW$91, DW_AT_decl_line(0x22)
    1706                    .dwattr $C$DW$91, DW_AT_decl_column(0x15)
    1707            
    1708            $C$DW$92        .dwtag  DW_TAG_member
    1709                    .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$22)
    1710                    .dwattr $C$DW$92, DW_AT_name("typeid")
    1711                    .dwattr $C$DW$92, DW_AT_TI_symbol_name("typeid")
    1712                    .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1713                    .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1714                    .dwattr $C$DW$92, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
    1715                    .dwattr $C$DW$92, DW_AT_decl_line(0x23)
    1716                    .dwattr $C$DW$92, DW_AT_decl_column(0x15)
    1717            
    1718            $C$DW$93        .dwtag  DW_TAG_member
    1719                    .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$22)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
bak.asm                                                              PAGE   35

    1720                    .dwattr $C$DW$93, DW_AT_name("pregain")
    1721                    .dwattr $C$DW$93, DW_AT_TI_symbol_name("pregain")
    1722                    .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1723                    .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1724                    .dwattr $C$DW$93, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
    1725                    .dwattr $C$DW$93, DW_AT_decl_line(0x24)
    1726                    .dwattr $C$DW$93, DW_AT_decl_column(0x15)
    1727            
    1728            $C$DW$94        .dwtag  DW_TAG_member
    1729                    .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$22)
    1730                    .dwattr $C$DW$94, DW_AT_name("gain")
    1731                    .dwattr $C$DW$94, DW_AT_TI_symbol_name("gain")
    1732                    .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1733                    .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1734                    .dwattr $C$DW$94, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
    1735                    .dwattr $C$DW$94, DW_AT_decl_line(0x25)
    1736                    .dwattr $C$DW$94, DW_AT_decl_column(0x15)
    1737            
    1738            $C$DW$95        .dwtag  DW_TAG_member
    1739                    .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$22)
    1740                    .dwattr $C$DW$95, DW_AT_name("attenuation")
    1741                    .dwattr $C$DW$95, DW_AT_TI_symbol_name("attenuation")
    1742                    .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1743                    .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1744                    .dwattr $C$DW$95, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
    1745                    .dwattr $C$DW$95, DW_AT_decl_line(0x26)
    1746                    .dwattr $C$DW$95, DW_AT_decl_column(0x15)
    1747            
    1748            $C$DW$96        .dwtag  DW_TAG_member
    1749                    .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$24)
    1750                    .dwattr $C$DW$96, DW_AT_name("DACbuffer")
    1751                    .dwattr $C$DW$96, DW_AT_TI_symbol_name("DACbuffer")
    1752                    .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1753                    .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1754                    .dwattr $C$DW$96, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
    1755                    .dwattr $C$DW$96, DW_AT_decl_line(0x29)
    1756                    .dwattr $C$DW$96, DW_AT_decl_column(0x15)
    1757            
    1758            $C$DW$97        .dwtag  DW_TAG_member
    1759                    .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$26)
    1760                    .dwattr $C$DW$97, DW_AT_name("tap1")
    1761                    .dwattr $C$DW$97, DW_AT_TI_symbol_name("tap1")
    1762                    .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1763                    .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1764                    .dwattr $C$DW$97, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
    1765                    .dwattr $C$DW$97, DW_AT_decl_line(0x2e)
    1766                    .dwattr $C$DW$97, DW_AT_decl_column(0x15)
    1767            
    1768            $C$DW$98        .dwtag  DW_TAG_member
    1769                    .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$26)
    1770                    .dwattr $C$DW$98, DW_AT_name("tap2")
    1771                    .dwattr $C$DW$98, DW_AT_TI_symbol_name("tap2")
    1772                    .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1773                    .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1774                    .dwattr $C$DW$98, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
bak.asm                                                              PAGE   36

    1775                    .dwattr $C$DW$98, DW_AT_decl_line(0x2f)
    1776                    .dwattr $C$DW$98, DW_AT_decl_column(0x15)
    1777            
    1778            $C$DW$99        .dwtag  DW_TAG_member
    1779                    .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$26)
    1780                    .dwattr $C$DW$99, DW_AT_name("xtap1")
    1781                    .dwattr $C$DW$99, DW_AT_TI_symbol_name("xtap1")
    1782                    .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    1783                    .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1784                    .dwattr $C$DW$99, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
    1785                    .dwattr $C$DW$99, DW_AT_decl_line(0x30)
    1786                    .dwattr $C$DW$99, DW_AT_decl_column(0x15)
    1787            
    1788            $C$DW$100       .dwtag  DW_TAG_member
    1789                    .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$26)
    1790                    .dwattr $C$DW$100, DW_AT_name("xtap2")
    1791                    .dwattr $C$DW$100, DW_AT_TI_symbol_name("xtap2")
    1792                    .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    1793                    .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1794                    .dwattr $C$DW$100, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
    1795                    .dwattr $C$DW$100, DW_AT_decl_line(0x31)
    1796                    .dwattr $C$DW$100, DW_AT_decl_column(0x15)
    1797            
    1798            $C$DW$101       .dwtag  DW_TAG_member
    1799                    .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$26)
    1800                    .dwattr $C$DW$101, DW_AT_name("ytap1")
    1801                    .dwattr $C$DW$101, DW_AT_TI_symbol_name("ytap1")
    1802                    .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1803                    .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1804                    .dwattr $C$DW$101, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
    1805                    .dwattr $C$DW$101, DW_AT_decl_line(0x32)
    1806                    .dwattr $C$DW$101, DW_AT_decl_column(0x15)
    1807            
    1808            $C$DW$102       .dwtag  DW_TAG_member
    1809                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$26)
    1810                    .dwattr $C$DW$102, DW_AT_name("ytap2")
    1811                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("ytap2")
    1812                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1813                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1814                    .dwattr $C$DW$102, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
    1815                    .dwattr $C$DW$102, DW_AT_decl_line(0x33)
    1816                    .dwattr $C$DW$102, DW_AT_decl_column(0x15)
    1817            
    1818            $C$DW$103       .dwtag  DW_TAG_member
    1819                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$22)
    1820                    .dwattr $C$DW$103, DW_AT_name("cycles")
    1821                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("cycles")
    1822                    .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    1823                    .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1824                    .dwattr $C$DW$103, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
    1825                    .dwattr $C$DW$103, DW_AT_decl_line(0x35)
    1826                    .dwattr $C$DW$103, DW_AT_decl_column(0x15)
    1827            
    1828            $C$DW$104       .dwtag  DW_TAG_member
    1829                    .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$22)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
bak.asm                                                              PAGE   37

    1830                    .dwattr $C$DW$104, DW_AT_name("seqcycles")
    1831                    .dwattr $C$DW$104, DW_AT_TI_symbol_name("seqcycles")
    1832                    .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1833                    .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1834                    .dwattr $C$DW$104, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
    1835                    .dwattr $C$DW$104, DW_AT_decl_line(0x36)
    1836                    .dwattr $C$DW$104, DW_AT_decl_column(0x15)
    1837            
    1838            $C$DW$105       .dwtag  DW_TAG_member
    1839                    .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$3)
    1840                    .dwattr $C$DW$105, DW_AT_name("next")
    1841                    .dwattr $C$DW$105, DW_AT_TI_symbol_name("next")
    1842                    .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    1843                    .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1844                    .dwattr $C$DW$105, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/i
    1845                    .dwattr $C$DW$105, DW_AT_decl_line(0x37)
    1846                    .dwattr $C$DW$105, DW_AT_decl_column(0x15)
    1847            
    1848                    .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
    1849                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x21)
    1850                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    1851                    .dwendtag $C$DW$T$27
    1852            
    1853            $C$DW$T$35      .dwtag  DW_TAG_typedef
    1854                    .dwattr $C$DW$T$35, DW_AT_name("CH_ChannelSpec")
    1855                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$27)
    1856                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1857                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
    1858                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x39)
    1859                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    1860            
    1861            $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    1862                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1863                    .dwattr $C$DW$T$36, DW_AT_address_class(0x14)
    1864            
    1865            
    1866            $C$DW$T$37      .dwtag  DW_TAG_array_type
    1867                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1868                    .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1869                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    1870            $C$DW$106       .dwtag  DW_TAG_subrange_type
    1871                    .dwattr $C$DW$106, DW_AT_upper_bound(0x04)
    1872            
    1873                    .dwendtag $C$DW$T$37
    1874            
    1875            
    1876            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1877                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x10)
    1878            $C$DW$107       .dwtag  DW_TAG_member
    1879                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$14)
    1880                    .dwattr $C$DW$107, DW_AT_name("__max_align1")
    1881                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("__max_align1")
    1882                    .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1883                    .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1884                    .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
bak.asm                                                              PAGE   38

    1885                    .dwattr $C$DW$107, DW_AT_decl_line(0x7b)
    1886                    .dwattr $C$DW$107, DW_AT_decl_column(0x0c)
    1887            
    1888            $C$DW$108       .dwtag  DW_TAG_member
    1889                    .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$18)
    1890                    .dwattr $C$DW$108, DW_AT_name("__max_align2")
    1891                    .dwattr $C$DW$108, DW_AT_TI_symbol_name("__max_align2")
    1892                    .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1893                    .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1894                    .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    1895                    .dwattr $C$DW$108, DW_AT_decl_line(0x7c)
    1896                    .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
    1897            
    1898                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1899                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x7a)
    1900                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    1901                    .dwendtag $C$DW$T$28
    1902            
    1903            $C$DW$T$41      .dwtag  DW_TAG_typedef
    1904                    .dwattr $C$DW$T$41, DW_AT_name("__max_align_t")
    1905                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$28)
    1906                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1907                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1908                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x7d)
    1909                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    1910            
    1911            
    1912            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1913                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1914            $C$DW$109       .dwtag  DW_TAG_member
    1915                    .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$10)
    1916                    .dwattr $C$DW$109, DW_AT_name("quot")
    1917                    .dwattr $C$DW$109, DW_AT_TI_symbol_name("quot")
    1918                    .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1919                    .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1920                    .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    1921                    .dwattr $C$DW$109, DW_AT_decl_line(0x56)
    1922                    .dwattr $C$DW$109, DW_AT_decl_column(0x16)
    1923            
    1924            $C$DW$110       .dwtag  DW_TAG_member
    1925                    .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$10)
    1926                    .dwattr $C$DW$110, DW_AT_name("rem")
    1927                    .dwattr $C$DW$110, DW_AT_TI_symbol_name("rem")
    1928                    .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1929                    .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1930                    .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    1931                    .dwattr $C$DW$110, DW_AT_decl_line(0x56)
    1932                    .dwattr $C$DW$110, DW_AT_decl_column(0x1c)
    1933            
    1934                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1935                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x56)
    1936                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    1937                    .dwendtag $C$DW$T$29
    1938            
    1939            $C$DW$T$42      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
bak.asm                                                              PAGE   39

    1940                    .dwattr $C$DW$T$42, DW_AT_name("div_t")
    1941                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$29)
    1942                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1943                    .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1944                    .dwattr $C$DW$T$42, DW_AT_decl_line(0x56)
    1945                    .dwattr $C$DW$T$42, DW_AT_decl_column(0x23)
    1946            
    1947            
    1948            $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1949                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    1950            $C$DW$111       .dwtag  DW_TAG_member
    1951                    .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$12)
    1952                    .dwattr $C$DW$111, DW_AT_name("quot")
    1953                    .dwattr $C$DW$111, DW_AT_TI_symbol_name("quot")
    1954                    .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1955                    .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1956                    .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    1957                    .dwattr $C$DW$111, DW_AT_decl_line(0x59)
    1958                    .dwattr $C$DW$111, DW_AT_decl_column(0x17)
    1959            
    1960            $C$DW$112       .dwtag  DW_TAG_member
    1961                    .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$12)
    1962                    .dwattr $C$DW$112, DW_AT_name("rem")
    1963                    .dwattr $C$DW$112, DW_AT_TI_symbol_name("rem")
    1964                    .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1965                    .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1966                    .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    1967                    .dwattr $C$DW$112, DW_AT_decl_line(0x59)
    1968                    .dwattr $C$DW$112, DW_AT_decl_column(0x1d)
    1969            
    1970                    .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1971                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x59)
    1972                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1973                    .dwendtag $C$DW$T$30
    1974            
    1975            $C$DW$T$43      .dwtag  DW_TAG_typedef
    1976                    .dwattr $C$DW$T$43, DW_AT_name("ldiv_t")
    1977                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$30)
    1978                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1979                    .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1980                    .dwattr $C$DW$T$43, DW_AT_decl_line(0x59)
    1981                    .dwattr $C$DW$T$43, DW_AT_decl_column(0x24)
    1982            
    1983            
    1984            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1985                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x10)
    1986            $C$DW$113       .dwtag  DW_TAG_member
    1987                    .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$14)
    1988                    .dwattr $C$DW$113, DW_AT_name("quot")
    1989                    .dwattr $C$DW$113, DW_AT_TI_symbol_name("quot")
    1990                    .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                    .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1992                    .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    1993                    .dwattr $C$DW$113, DW_AT_decl_line(0x63)
    1994                    .dwattr $C$DW$113, DW_AT_decl_column(0x1c)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
bak.asm                                                              PAGE   40

    1995            
    1996            $C$DW$114       .dwtag  DW_TAG_member
    1997                    .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$14)
    1998                    .dwattr $C$DW$114, DW_AT_name("rem")
    1999                    .dwattr $C$DW$114, DW_AT_TI_symbol_name("rem")
    2000                    .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2001                    .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2002                    .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2003                    .dwattr $C$DW$114, DW_AT_decl_line(0x63)
    2004                    .dwattr $C$DW$114, DW_AT_decl_column(0x22)
    2005            
    2006                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2007                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x63)
    2008                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    2009                    .dwendtag $C$DW$T$31
    2010            
    2011            $C$DW$T$44      .dwtag  DW_TAG_typedef
    2012                    .dwattr $C$DW$T$44, DW_AT_name("lldiv_t")
    2013                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$31)
    2014                    .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2015                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2016                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x63)
    2017                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x29)
    2018            
    2019            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2020                    .dwattr $C$DW$T$2, DW_AT_name("void")
    2021            
    2022            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2023                    .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2024                    .dwattr $C$DW$T$3, DW_AT_address_class(0x14)
    2025            
    2026            
    2027            $C$DW$T$47      .dwtag  DW_TAG_subroutine_type
    2028                    .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2029                    .dwendtag $C$DW$T$47
    2030            
    2031            $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    2032                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    2033                    .dwattr $C$DW$T$48, DW_AT_address_class(0x14)
    2034            
    2035            $C$DW$T$49      .dwtag  DW_TAG_typedef
    2036                    .dwattr $C$DW$T$49, DW_AT_name("__TI_atexit_fn")
    2037                    .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2038                    .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2039                    .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2040                    .dwattr $C$DW$T$49, DW_AT_decl_line(0xcf)
    2041                    .dwattr $C$DW$T$49, DW_AT_decl_column(0x14)
    2042            
    2043            
    2044            $C$DW$T$50      .dwtag  DW_TAG_subroutine_type
    2045                    .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2046                    .dwendtag $C$DW$T$50
    2047            
    2048            $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    2049                    .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
bak.asm                                                              PAGE   41

    2050                    .dwattr $C$DW$T$51, DW_AT_address_class(0x14)
    2051            
    2052            $C$DW$T$52      .dwtag  DW_TAG_typedef
    2053                    .dwattr $C$DW$T$52, DW_AT_name("__SFR_FARPTR")
    2054                    .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    2055                    .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2056                    .dwattr $C$DW$T$52, DW_AT_decl_file("C:\ti\ccs1250\ccs\ccs_base\msp430\include\msp430fg6626.h"
    2057                    .dwattr $C$DW$T$52, DW_AT_decl_line(0x46)
    2058                    .dwattr $C$DW$T$52, DW_AT_decl_column(0x11)
