MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
channels.asm                                                         PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Mon Feb 24 13:22:57 2025                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/channels.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\Deb
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("PIXIE_SequenceID")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("PIXIE_SequenceID")

     374 0001e0 1840!         MOVX.W    &PIXIE_SequenceSeqCycles+4,&CH_ChannelSequence+312 ; [] |120| 
         0001e2 4292 
         0001e4 0004 
         0001e6 0138 
     375                    .dwpsn  file "../src/channels.c",line 123,column 9,is_stmt,isa 0
     376 0001e8 1800!         MOVX.A    #CH_ChannelSequence+318,&CH_ChannelSequence+314 ; [] |123| 
         0001ea 40F2 
         0001ec 013E 
         0001ee 013A 
     377                    .dwpsn  file "../src/channels.c",line 114,column 9,is_stmt,isa 0
     378 0001f0 1840!         MOVX.W    &PIXIE_SequenceID+6,&CH_ChannelSequence+318 ; [] |114| 
         0001f2 4292 
         0001f4 0006 
         0001f6 013E 
     379                    .dwpsn  file "../src/channels.c",line 115,column 9,is_stmt,isa 0
     380 0001f8 1840!         MOVX.W    &PIXIE_SequenceID+6,r15 ; [] |115| 
         0001fa 421F 
         0001fc 0006 
     381 0001fe 065F          RLAM.W    #2,r15                ; [] |115| 
     382 000200 1800!         MOVX.A    CH_Channels+0(r15),r15 ; [] |115| 
         000202 4F5F 
         000204 0000 
     383 000206 4F92          MOV.W     2(r15),&CH_ChannelSequence+320 ; [] |115| 
         000208 0002 
         00020a 0140!
     384                    .dwpsn  file "../src/channels.c",line 116,column 9,is_stmt,isa 0
     385 00020c 1840!         MOVX.W    &PIXIE_SequencePregain+6,&CH_ChannelSequence+322 ; [] |116| 
         00020e 4292 
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
channels.asm                                                         PAGE   11

         000210 0006 
         000212 0142 
     386                    .dwpsn  file "../src/channels.c",line 117,column 9,is_stmt,isa 0
     387 000214 1840!         MOVX.W    &PIXIE_SequenceGain+6,&CH_ChannelSequence+324 ; [] |117| 
         000216 4292 
         000218 0006 
         00021a 0144 
     388                    .dwpsn  file "../src/channels.c",line 118,column 9,is_stmt,isa 0
     389 00021c 1840!         MOVX.W    &PIXIE_SequenceAttenuation+6,&CH_ChannelSequence+326 ; [] |118| 
         00021e 4292 
         000220 0006 
         000222 0146 
     390                    .dwpsn  file "../src/channels.c",line 119,column 9,is_stmt,isa 0
     391 000224 4382          MOV.W     #0,&CH_ChannelSequence+416 ; [] |119| 
         000226 01A0!
     392                    .dwpsn  file "../src/channels.c",line 120,column 9,is_stmt,isa 0
     393 000228 1840!         MOVX.W    &PIXIE_SequenceSeqCycles+6,&CH_ChannelSequence+418 ; [] |120| 
         00022a 4292 
         00022c 0006 
         00022e 01A2 
     394                    .dwpsn  file "../src/channels.c",line 123,column 9,is_stmt,isa 0
     395 000230 1800!         MOVX.A    #CH_ChannelSequence+0,&CH_ChannelSequence+420 ; [] |123| 
         000232 40F2 
         000234 0000 
         000236 01A4 
     396            $C$DW$16        .dwtag  DW_TAG_TI_branch
     397                    .dwattr $C$DW$16, DW_AT_low_pc(0x00)
     398                    .dwattr $C$DW$16, DW_AT_TI_return
     399            
     400 000238 0110          RETA      ; [] 
     401                    ; [] 
     402                    .dwattr $C$DW$15, DW_AT_TI_end_file("../src/channels.c")
     403                    .dwattr $C$DW$15, DW_AT_TI_end_line(0x80)
     404                    .dwattr $C$DW$15, DW_AT_TI_end_column(0x01)
     405                    .dwendentry
     406                    .dwendtag $C$DW$15
     407            
     408            ;*****************************************************************************
     409            ;* UNDEFINED EXTERNAL REFERENCES                                             *
     410            ;*****************************************************************************
     411                    .global PIXIE_SequenceID
     412                    .global PIXIE_SequencePregain
     413                    .global PIXIE_SequenceGain
     414                    .global PIXIE_SequenceAttenuation
     415                    .global PIXIE_SequenceSeqCycles
     416            
     417            ;******************************************************************************
     418            ;* BUILD ATTRIBUTES                                                           *
     419            ;******************************************************************************
     420                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     421                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111100000000
     422                    .battr "TI", Tag_File, 1, Tag_LEA_INFO(1)
     423                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
     424                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
     425                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(2)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
channels.asm                                                         PAGE   12

     426                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
     427            
     428            ;******************************************************************************
     429            ;* TYPE INFORMATION                                                           *
     430            ;******************************************************************************
     431            
     432            $C$DW$T$26      .dwtag  DW_TAG_structure_type
     433                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x6a)
     434            $C$DW$17        .dwtag  DW_TAG_member
     435                    .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$22)
     436                    .dwattr $C$DW$17, DW_AT_name("id")
     437                    .dwattr $C$DW$17, DW_AT_TI_symbol_name("id")
     438                    .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     439                    .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     440                    .dwattr $C$DW$17, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     441                    .dwattr $C$DW$17, DW_AT_decl_line(0x22)
     442                    .dwattr $C$DW$17, DW_AT_decl_column(0x15)
     443            
     444            $C$DW$18        .dwtag  DW_TAG_member
     445                    .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$22)
     446                    .dwattr $C$DW$18, DW_AT_name("typeid")
     447                    .dwattr $C$DW$18, DW_AT_TI_symbol_name("typeid")
     448                    .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     449                    .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     450                    .dwattr $C$DW$18, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     451                    .dwattr $C$DW$18, DW_AT_decl_line(0x23)
     452                    .dwattr $C$DW$18, DW_AT_decl_column(0x15)
     453            
     454            $C$DW$19        .dwtag  DW_TAG_member
     455                    .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$22)
     456                    .dwattr $C$DW$19, DW_AT_name("pregain")
     457                    .dwattr $C$DW$19, DW_AT_TI_symbol_name("pregain")
     458                    .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     459                    .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     460                    .dwattr $C$DW$19, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     461                    .dwattr $C$DW$19, DW_AT_decl_line(0x24)
     462                    .dwattr $C$DW$19, DW_AT_decl_column(0x15)
     463            
     464            $C$DW$20        .dwtag  DW_TAG_member
     465                    .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$22)
     466                    .dwattr $C$DW$20, DW_AT_name("gain")
     467                    .dwattr $C$DW$20, DW_AT_TI_symbol_name("gain")
     468                    .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     469                    .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     470                    .dwattr $C$DW$20, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     471                    .dwattr $C$DW$20, DW_AT_decl_line(0x25)
     472                    .dwattr $C$DW$20, DW_AT_decl_column(0x15)
     473            
     474            $C$DW$21        .dwtag  DW_TAG_member
     475                    .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$22)
     476                    .dwattr $C$DW$21, DW_AT_name("attenuation")
     477                    .dwattr $C$DW$21, DW_AT_TI_symbol_name("attenuation")
     478                    .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     479                    .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     480                    .dwattr $C$DW$21, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
channels.asm                                                         PAGE   13

     481                    .dwattr $C$DW$21, DW_AT_decl_line(0x26)
     482                    .dwattr $C$DW$21, DW_AT_decl_column(0x15)
     483            
     484            $C$DW$22        .dwtag  DW_TAG_member
     485                    .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$23)
     486                    .dwattr $C$DW$22, DW_AT_name("DACbuffer")
     487                    .dwattr $C$DW$22, DW_AT_TI_symbol_name("DACbuffer")
     488                    .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     489                    .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     490                    .dwattr $C$DW$22, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     491                    .dwattr $C$DW$22, DW_AT_decl_line(0x29)
     492                    .dwattr $C$DW$22, DW_AT_decl_column(0x15)
     493            
     494            $C$DW$23        .dwtag  DW_TAG_member
     495                    .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$25)
     496                    .dwattr $C$DW$23, DW_AT_name("tap1")
     497                    .dwattr $C$DW$23, DW_AT_TI_symbol_name("tap1")
     498                    .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
     499                    .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     500                    .dwattr $C$DW$23, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     501                    .dwattr $C$DW$23, DW_AT_decl_line(0x2e)
     502                    .dwattr $C$DW$23, DW_AT_decl_column(0x15)
     503            
     504            $C$DW$24        .dwtag  DW_TAG_member
     505                    .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$25)
     506                    .dwattr $C$DW$24, DW_AT_name("tap2")
     507                    .dwattr $C$DW$24, DW_AT_TI_symbol_name("tap2")
     508                    .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
     509                    .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     510                    .dwattr $C$DW$24, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     511                    .dwattr $C$DW$24, DW_AT_decl_line(0x2f)
     512                    .dwattr $C$DW$24, DW_AT_decl_column(0x15)
     513            
     514            $C$DW$25        .dwtag  DW_TAG_member
     515                    .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$25)
     516                    .dwattr $C$DW$25, DW_AT_name("xtap1")
     517                    .dwattr $C$DW$25, DW_AT_TI_symbol_name("xtap1")
     518                    .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
     519                    .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     520                    .dwattr $C$DW$25, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     521                    .dwattr $C$DW$25, DW_AT_decl_line(0x30)
     522                    .dwattr $C$DW$25, DW_AT_decl_column(0x15)
     523            
     524            $C$DW$26        .dwtag  DW_TAG_member
     525                    .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$25)
     526                    .dwattr $C$DW$26, DW_AT_name("xtap2")
     527                    .dwattr $C$DW$26, DW_AT_TI_symbol_name("xtap2")
     528                    .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
     529                    .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     530                    .dwattr $C$DW$26, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     531                    .dwattr $C$DW$26, DW_AT_decl_line(0x31)
     532                    .dwattr $C$DW$26, DW_AT_decl_column(0x15)
     533            
     534            $C$DW$27        .dwtag  DW_TAG_member
     535                    .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$25)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
channels.asm                                                         PAGE   14

     536                    .dwattr $C$DW$27, DW_AT_name("ytap1")
     537                    .dwattr $C$DW$27, DW_AT_TI_symbol_name("ytap1")
     538                    .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
     539                    .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     540                    .dwattr $C$DW$27, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     541                    .dwattr $C$DW$27, DW_AT_decl_line(0x32)
     542                    .dwattr $C$DW$27, DW_AT_decl_column(0x15)
     543            
     544            $C$DW$28        .dwtag  DW_TAG_member
     545                    .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$25)
     546                    .dwattr $C$DW$28, DW_AT_name("ytap2")
     547                    .dwattr $C$DW$28, DW_AT_TI_symbol_name("ytap2")
     548                    .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
     549                    .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     550                    .dwattr $C$DW$28, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     551                    .dwattr $C$DW$28, DW_AT_decl_line(0x33)
     552                    .dwattr $C$DW$28, DW_AT_decl_column(0x15)
     553            
     554            $C$DW$29        .dwtag  DW_TAG_member
     555                    .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$22)
     556                    .dwattr $C$DW$29, DW_AT_name("cycles")
     557                    .dwattr $C$DW$29, DW_AT_TI_symbol_name("cycles")
     558                    .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
     559                    .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     560                    .dwattr $C$DW$29, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     561                    .dwattr $C$DW$29, DW_AT_decl_line(0x35)
     562                    .dwattr $C$DW$29, DW_AT_decl_column(0x15)
     563            
     564            $C$DW$30        .dwtag  DW_TAG_member
     565                    .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$22)
     566                    .dwattr $C$DW$30, DW_AT_name("seqcycles")
     567                    .dwattr $C$DW$30, DW_AT_TI_symbol_name("seqcycles")
     568                    .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
     569                    .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     570                    .dwattr $C$DW$30, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     571                    .dwattr $C$DW$30, DW_AT_decl_line(0x36)
     572                    .dwattr $C$DW$30, DW_AT_decl_column(0x15)
     573            
     574            $C$DW$31        .dwtag  DW_TAG_member
     575                    .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$3)
     576                    .dwattr $C$DW$31, DW_AT_name("next")
     577                    .dwattr $C$DW$31, DW_AT_TI_symbol_name("next")
     578                    .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
     579                    .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     580                    .dwattr $C$DW$31, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     581                    .dwattr $C$DW$31, DW_AT_decl_line(0x37)
     582                    .dwattr $C$DW$31, DW_AT_decl_column(0x15)
     583            
     584                    .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
     585                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x21)
     586                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
     587                    .dwendtag $C$DW$T$26
     588            
     589            $C$DW$T$31      .dwtag  DW_TAG_typedef
     590                    .dwattr $C$DW$T$31, DW_AT_name("CH_ChannelSpec")
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
channels.asm                                                         PAGE   15

     591                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$26)
     592                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
     593                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
     594                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x39)
     595                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
     596            
     597            $C$DW$T$32      .dwtag  DW_TAG_pointer_type
     598                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
     599                    .dwattr $C$DW$T$32, DW_AT_address_class(0x14)
     600            
     601            
     602            $C$DW$T$33      .dwtag  DW_TAG_array_type
     603                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
     604                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
     605                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x14)
     606            $C$DW$32        .dwtag  DW_TAG_subrange_type
     607                    .dwattr $C$DW$32, DW_AT_upper_bound(0x04)
     608            
     609                    .dwendtag $C$DW$T$33
     610            
     611            
     612            $C$DW$T$34      .dwtag  DW_TAG_array_type
     613                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
     614                    .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
     615                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x1a8)
     616            $C$DW$33        .dwtag  DW_TAG_subrange_type
     617                    .dwattr $C$DW$33, DW_AT_upper_bound(0x03)
     618            
     619                    .dwendtag $C$DW$T$34
     620            
     621            
     622            $C$DW$T$27      .dwtag  DW_TAG_structure_type
     623                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
     624            $C$DW$34        .dwtag  DW_TAG_member
     625                    .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$14)
     626                    .dwattr $C$DW$34, DW_AT_name("__max_align1")
     627                    .dwattr $C$DW$34, DW_AT_TI_symbol_name("__max_align1")
     628                    .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     629                    .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     630                    .dwattr $C$DW$34, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     631                    .dwattr $C$DW$34, DW_AT_decl_line(0x7b)
     632                    .dwattr $C$DW$34, DW_AT_decl_column(0x0c)
     633            
     634            $C$DW$35        .dwtag  DW_TAG_member
     635                    .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$18)
     636                    .dwattr $C$DW$35, DW_AT_name("__max_align2")
     637                    .dwattr $C$DW$35, DW_AT_TI_symbol_name("__max_align2")
     638                    .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     639                    .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     640                    .dwattr $C$DW$35, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     641                    .dwattr $C$DW$35, DW_AT_decl_line(0x7c)
     642                    .dwattr $C$DW$35, DW_AT_decl_column(0x0e)
     643            
     644                    .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     645                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x7a)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
channels.asm                                                         PAGE   16

     646                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
     647                    .dwendtag $C$DW$T$27
     648            
     649            $C$DW$T$39      .dwtag  DW_TAG_typedef
     650                    .dwattr $C$DW$T$39, DW_AT_name("__max_align_t")
     651                    .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$27)
     652                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
     653                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     654                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x7d)
     655                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
     656            
     657            
     658            $C$DW$T$28      .dwtag  DW_TAG_structure_type
     659                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     660            $C$DW$36        .dwtag  DW_TAG_member
     661                    .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$10)
     662                    .dwattr $C$DW$36, DW_AT_name("quot")
     663                    .dwattr $C$DW$36, DW_AT_TI_symbol_name("quot")
     664                    .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     665                    .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     666                    .dwattr $C$DW$36, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     667                    .dwattr $C$DW$36, DW_AT_decl_line(0x56)
     668                    .dwattr $C$DW$36, DW_AT_decl_column(0x16)
     669            
     670            $C$DW$37        .dwtag  DW_TAG_member
     671                    .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$10)
     672                    .dwattr $C$DW$37, DW_AT_name("rem")
     673                    .dwattr $C$DW$37, DW_AT_TI_symbol_name("rem")
     674                    .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     675                    .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     676                    .dwattr $C$DW$37, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     677                    .dwattr $C$DW$37, DW_AT_decl_line(0x56)
     678                    .dwattr $C$DW$37, DW_AT_decl_column(0x1c)
     679            
     680                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     681                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x56)
     682                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
     683                    .dwendtag $C$DW$T$28
     684            
     685            $C$DW$T$40      .dwtag  DW_TAG_typedef
     686                    .dwattr $C$DW$T$40, DW_AT_name("div_t")
     687                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$28)
     688                    .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     689                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     690                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x56)
     691                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x23)
     692            
     693            
     694            $C$DW$T$29      .dwtag  DW_TAG_structure_type
     695                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
     696            $C$DW$38        .dwtag  DW_TAG_member
     697                    .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$12)
     698                    .dwattr $C$DW$38, DW_AT_name("quot")
     699                    .dwattr $C$DW$38, DW_AT_TI_symbol_name("quot")
     700                    .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
channels.asm                                                         PAGE   17

     701                    .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     702                    .dwattr $C$DW$38, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     703                    .dwattr $C$DW$38, DW_AT_decl_line(0x59)
     704                    .dwattr $C$DW$38, DW_AT_decl_column(0x17)
     705            
     706            $C$DW$39        .dwtag  DW_TAG_member
     707                    .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$12)
     708                    .dwattr $C$DW$39, DW_AT_name("rem")
     709                    .dwattr $C$DW$39, DW_AT_TI_symbol_name("rem")
     710                    .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     711                    .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     712                    .dwattr $C$DW$39, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     713                    .dwattr $C$DW$39, DW_AT_decl_line(0x59)
     714                    .dwattr $C$DW$39, DW_AT_decl_column(0x1d)
     715            
     716                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     717                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x59)
     718                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
     719                    .dwendtag $C$DW$T$29
     720            
     721            $C$DW$T$41      .dwtag  DW_TAG_typedef
     722                    .dwattr $C$DW$T$41, DW_AT_name("ldiv_t")
     723                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$29)
     724                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
     725                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     726                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x59)
     727                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x24)
     728            
     729            
     730            $C$DW$T$30      .dwtag  DW_TAG_structure_type
     731                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
     732            $C$DW$40        .dwtag  DW_TAG_member
     733                    .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$14)
     734                    .dwattr $C$DW$40, DW_AT_name("quot")
     735                    .dwattr $C$DW$40, DW_AT_TI_symbol_name("quot")
     736                    .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     737                    .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     738                    .dwattr $C$DW$40, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     739                    .dwattr $C$DW$40, DW_AT_decl_line(0x63)
     740                    .dwattr $C$DW$40, DW_AT_decl_column(0x1c)
     741            
     742            $C$DW$41        .dwtag  DW_TAG_member
     743                    .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$14)
     744                    .dwattr $C$DW$41, DW_AT_name("rem")
     745                    .dwattr $C$DW$41, DW_AT_TI_symbol_name("rem")
     746                    .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     747                    .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     748                    .dwattr $C$DW$41, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     749                    .dwattr $C$DW$41, DW_AT_decl_line(0x63)
     750                    .dwattr $C$DW$41, DW_AT_decl_column(0x22)
     751            
     752                    .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     753                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x63)
     754                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
     755                    .dwendtag $C$DW$T$30
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:22:57 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
channels.asm                                                         PAGE   18

     756            
     757            $C$DW$T$42      .dwtag  DW_TAG_typedef
     758                    .dwattr $C$DW$T$42, DW_AT_name("lldiv_t")
     759                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$30)
     760                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
     761                    .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     762                    .dwattr $C$DW$T$42, DW_AT_decl_line(0x63)
     763                    .dwattr $C$DW$T$42, DW_AT_decl_column(0x29)
     764            
     765            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     766                    .dwattr $C$DW$T$2, DW_AT_name("void")
     767            
     768            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     769                    .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     770                    .dwattr $C$DW$T$3, DW_AT_address_class(0x14)
     771            
     772            
     773            $C$DW$T$44      .dwtag  DW_TAG_subroutine_type
     774                    .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
     775                    .dwendtag $C$DW$T$44
     776            
     777            $C$DW$T$45      .dwtag  DW_TAG_pointer_type
     778                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
     779                    .dwattr $C$DW$T$45, DW_AT_address_class(0x14)
     780            
     781            $C$DW$T$46      .dwtag  DW_TAG_typedef
     782                    .dwattr $C$DW$T$46, DW_AT_name("__TI_atexit_fn")
     783                    .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
     784                    .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
     785                    .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     786                    .dwattr $C$DW$T$46, DW_AT_decl_line(0xcf)
     787                    .dwattr $C$DW$T$46, DW_AT_decl_column(0x14)
     788            
     789            
     790            $C$DW$T$47      .dwtag  DW_TAG_subroutine_type
     791                    .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
     792                    .dwendtag $C$DW$T$47
     793            
     794            $C$DW$T$48      .dwtag  DW_TAG_pointer_type
     795                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
     796                    .dwattr $C$DW$T$48, DW_AT_address_class(0x14)
     797            
     798            $C$DW$T$49      .dwtag  DW_TAG_typedef
     799                    .dwattr $C$DW$T$49, DW_AT_name("__SFR_FARPTR")
     800                    .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
     801                    .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
     802                    .dwattr $C$DW$T$49, DW_AT_decl_file("C:\ti\ccs1250\ccs\ccs_base\msp430\include\msp430fg6626.h"
     803                    .dwattr $C$DW$T$49, DW_AT_decl_line(0x46)
     804                    .dwattr $C$DW$T$49, DW_AT_decl_column(0x11)
