MSP430 Assembler PC v21.6.1 Mon Feb 24 13:28:08 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
clk.asm                                                              PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Mon Feb 24 13:28:08 2025                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/clk.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\kyle_\Documents\CodeComposerStudio\PIXIE_MSP430\Deb
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("BAKMEM0")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("BAKMEM0")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$80)

     500                    .dwattr $C$DW$29, DW_AT_name("time")
     501                    .dwattr $C$DW$29, DW_AT_TI_symbol_name("time")
     502                    .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$30)
     503                    .dwattr $C$DW$29, DW_AT_location[DW_OP_reg12]
     504            
     505                    .dwcfi  cfa_offset, 4
     506                    .dwcfi  save_reg_to_mem, 16, -4
     507                    .dwpsn  file "../src/clk.c",line 152,column 5,is_stmt,isa 0
     508 000000 429C          MOV.W     &RTCYEAR+0,0(r12)     ; [] |152| 
         000002 0000!
         000004 0000 
     509                    .dwpsn  file "../src/clk.c",line 153,column 5,is_stmt,isa 0
     510 000006 425F          MOV.B     &RTCDATE_H+0,r15      ; [] |153| 
         000008 0000!
     511 00000a 4F8C          MOV.W     r15,2(r12)            ; [] |153| 
         00000c 0002 
     512                    .dwpsn  file "../src/clk.c",line 154,column 5,is_stmt,isa 0
     513 00000e 425F          MOV.B     &RTCDATE_L+0,r15      ; [] |154| 
         000010 0000!
     514 000012 4F8C          MOV.W     r15,4(r12)            ; [] |154| 
         000014 0004 
     515                    .dwpsn  file "../src/clk.c",line 155,column 5,is_stmt,isa 0
     516 000016 425F          MOV.B     &RTCTIM1_L+0,r15      ; [] |155| 
         000018 0000!
     517 00001a 4F8C          MOV.W     r15,6(r12)            ; [] |155| 
         00001c 0006 
     518                    .dwpsn  file "../src/clk.c",line 156,column 5,is_stmt,isa 0
     519 00001e 425F          MOV.B     &RTCTIM0_H+0,r15      ; [] |156| 
         000020 0000!
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:28:08 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
clk.asm                                                              PAGE   12

     520 000022 4F8C          MOV.W     r15,8(r12)            ; [] |156| 
         000024 0008 
     521                    .dwpsn  file "../src/clk.c",line 157,column 5,is_stmt,isa 0
     522 000026 425F          MOV.B     &RTCTIM0_L+0,r15      ; [] |157| 
         000028 0000!
     523 00002a 4F8C          MOV.W     r15,10(r12)           ; [] |157| 
         00002c 000A 
     524            $C$DW$30        .dwtag  DW_TAG_TI_branch
     525                    .dwattr $C$DW$30, DW_AT_low_pc(0x00)
     526                    .dwattr $C$DW$30, DW_AT_TI_return
     527            
     528 00002e 0110          RETA      ; [] 
     529                    ; [] 
     530                    .dwattr $C$DW$27, DW_AT_TI_end_file("../src/clk.c")
     531                    .dwattr $C$DW$27, DW_AT_TI_end_line(0xa0)
     532                    .dwattr $C$DW$27, DW_AT_TI_end_column(0x01)
     533                    .dwendentry
     534                    .dwendtag $C$DW$27
     535            
     536            ;*****************************************************************************
     537            ;* UNDEFINED EXTERNAL REFERENCES                                             *
     538            ;*****************************************************************************
     539                    .global BAKMEM0
     540                    .global BAKMEM1
     541                    .global BAKMEM2
     542                    .global BAKMEM3
     543                    .global BAKCTL
     544                    .global PDSEL_L
     545                    .global RTCCTL01
     546                    .global RTCCTL01_H
     547                    .global RTCCTL23_L
     548                    .global RTCTIM0_L
     549                    .global RTCTIM0_H
     550                    .global RTCTIM1_L
     551                    .global RTCTIM1_H
     552                    .global RTCDATE_L
     553                    .global RTCDATE_H
     554                    .global RTCYEAR
     555                    .global SFRIFG1
     556                    .global UCSCTL4
     557                    .global UCSCTL6
     558                    .global UCSCTL7
     559            
     560            ;******************************************************************************
     561            ;* BUILD ATTRIBUTES                                                           *
     562            ;******************************************************************************
     563                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     564                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111100000000
     565                    .battr "TI", Tag_File, 1, Tag_LEA_INFO(1)
     566                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
     567                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
     568                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(2)
     569                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
     570            
     571            ;******************************************************************************
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:28:08 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
clk.asm                                                              PAGE   13

     572            ;* TYPE INFORMATION                                                           *
     573            ;******************************************************************************
     574            
     575            $C$DW$T$23      .dwtag  DW_TAG_structure_type
     576                    .dwattr $C$DW$T$23, DW_AT_byte_size(0x0c)
     577            $C$DW$31        .dwtag  DW_TAG_member
     578                    .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$22)
     579                    .dwattr $C$DW$31, DW_AT_name("year")
     580                    .dwattr $C$DW$31, DW_AT_TI_symbol_name("year")
     581                    .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     582                    .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     583                    .dwattr $C$DW$31, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     584                    .dwattr $C$DW$31, DW_AT_decl_line(0x2a)
     585                    .dwattr $C$DW$31, DW_AT_decl_column(0x11)
     586            
     587            $C$DW$32        .dwtag  DW_TAG_member
     588                    .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$22)
     589                    .dwattr $C$DW$32, DW_AT_name("month")
     590                    .dwattr $C$DW$32, DW_AT_TI_symbol_name("month")
     591                    .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     592                    .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     593                    .dwattr $C$DW$32, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     594                    .dwattr $C$DW$32, DW_AT_decl_line(0x2b)
     595                    .dwattr $C$DW$32, DW_AT_decl_column(0x11)
     596            
     597            $C$DW$33        .dwtag  DW_TAG_member
     598                    .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$22)
     599                    .dwattr $C$DW$33, DW_AT_name("day")
     600                    .dwattr $C$DW$33, DW_AT_TI_symbol_name("day")
     601                    .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     602                    .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     603                    .dwattr $C$DW$33, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     604                    .dwattr $C$DW$33, DW_AT_decl_line(0x2c)
     605                    .dwattr $C$DW$33, DW_AT_decl_column(0x11)
     606            
     607            $C$DW$34        .dwtag  DW_TAG_member
     608                    .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$22)
     609                    .dwattr $C$DW$34, DW_AT_name("hour")
     610                    .dwattr $C$DW$34, DW_AT_TI_symbol_name("hour")
     611                    .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     612                    .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     613                    .dwattr $C$DW$34, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     614                    .dwattr $C$DW$34, DW_AT_decl_line(0x2d)
     615                    .dwattr $C$DW$34, DW_AT_decl_column(0x11)
     616            
     617            $C$DW$35        .dwtag  DW_TAG_member
     618                    .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$22)
     619                    .dwattr $C$DW$35, DW_AT_name("min")
     620                    .dwattr $C$DW$35, DW_AT_TI_symbol_name("min")
     621                    .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     622                    .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     623                    .dwattr $C$DW$35, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     624                    .dwattr $C$DW$35, DW_AT_decl_line(0x2e)
     625                    .dwattr $C$DW$35, DW_AT_decl_column(0x11)
     626            
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:28:08 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
clk.asm                                                              PAGE   14

     627            $C$DW$36        .dwtag  DW_TAG_member
     628                    .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$22)
     629                    .dwattr $C$DW$36, DW_AT_name("sec")
     630                    .dwattr $C$DW$36, DW_AT_TI_symbol_name("sec")
     631                    .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     632                    .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     633                    .dwattr $C$DW$36, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/in
     634                    .dwattr $C$DW$36, DW_AT_decl_line(0x2f)
     635                    .dwattr $C$DW$36, DW_AT_decl_column(0x11)
     636            
     637                    .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
     638                    .dwattr $C$DW$T$23, DW_AT_decl_line(0x29)
     639                    .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
     640                    .dwendtag $C$DW$T$23
     641            
     642            $C$DW$T$28      .dwtag  DW_TAG_typedef
     643                    .dwattr $C$DW$T$28, DW_AT_name("CLK_TimeStamp")
     644                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$23)
     645                    .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     646                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/kyle_/Documents/CodeComposerStudio/PIXIE_MSP430/
     647                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x30)
     648                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
     649            
     650            $C$DW$T$29      .dwtag  DW_TAG_pointer_type
     651                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
     652                    .dwattr $C$DW$T$29, DW_AT_address_class(0x14)
     653            
     654            $C$DW$37        .dwtag  DW_TAG_TI_far_type
     655                    .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$29)
     656            
     657            $C$DW$T$30      .dwtag  DW_TAG_const_type
     658                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$37)
     659            
     660            
     661            $C$DW$T$24      .dwtag  DW_TAG_structure_type
     662                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
     663            $C$DW$38        .dwtag  DW_TAG_member
     664                    .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$14)
     665                    .dwattr $C$DW$38, DW_AT_name("__max_align1")
     666                    .dwattr $C$DW$38, DW_AT_TI_symbol_name("__max_align1")
     667                    .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     668                    .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     669                    .dwattr $C$DW$38, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     670                    .dwattr $C$DW$38, DW_AT_decl_line(0x7b)
     671                    .dwattr $C$DW$38, DW_AT_decl_column(0x0c)
     672            
     673            $C$DW$39        .dwtag  DW_TAG_member
     674                    .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$18)
     675                    .dwattr $C$DW$39, DW_AT_name("__max_align2")
     676                    .dwattr $C$DW$39, DW_AT_TI_symbol_name("__max_align2")
     677                    .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     678                    .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     679                    .dwattr $C$DW$39, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     680                    .dwattr $C$DW$39, DW_AT_decl_line(0x7c)
     681                    .dwattr $C$DW$39, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:28:08 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
clk.asm                                                              PAGE   15

     682            
     683                    .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     684                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x7a)
     685                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
     686                    .dwendtag $C$DW$T$24
     687            
     688            $C$DW$T$33      .dwtag  DW_TAG_typedef
     689                    .dwattr $C$DW$T$33, DW_AT_name("__max_align_t")
     690                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$24)
     691                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
     692                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     693                    .dwattr $C$DW$T$33, DW_AT_decl_line(0x7d)
     694                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x03)
     695            
     696            
     697            $C$DW$T$25      .dwtag  DW_TAG_structure_type
     698                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     699            $C$DW$40        .dwtag  DW_TAG_member
     700                    .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$10)
     701                    .dwattr $C$DW$40, DW_AT_name("quot")
     702                    .dwattr $C$DW$40, DW_AT_TI_symbol_name("quot")
     703                    .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     704                    .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     705                    .dwattr $C$DW$40, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     706                    .dwattr $C$DW$40, DW_AT_decl_line(0x56)
     707                    .dwattr $C$DW$40, DW_AT_decl_column(0x16)
     708            
     709            $C$DW$41        .dwtag  DW_TAG_member
     710                    .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$10)
     711                    .dwattr $C$DW$41, DW_AT_name("rem")
     712                    .dwattr $C$DW$41, DW_AT_TI_symbol_name("rem")
     713                    .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     714                    .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     715                    .dwattr $C$DW$41, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     716                    .dwattr $C$DW$41, DW_AT_decl_line(0x56)
     717                    .dwattr $C$DW$41, DW_AT_decl_column(0x1c)
     718            
     719                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     720                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x56)
     721                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     722                    .dwendtag $C$DW$T$25
     723            
     724            $C$DW$T$34      .dwtag  DW_TAG_typedef
     725                    .dwattr $C$DW$T$34, DW_AT_name("div_t")
     726                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$25)
     727                    .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
     728                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     729                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x56)
     730                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x23)
     731            
     732            
     733            $C$DW$T$26      .dwtag  DW_TAG_structure_type
     734                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
     735            $C$DW$42        .dwtag  DW_TAG_member
     736                    .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$12)
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:28:08 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
clk.asm                                                              PAGE   16

     737                    .dwattr $C$DW$42, DW_AT_name("quot")
     738                    .dwattr $C$DW$42, DW_AT_TI_symbol_name("quot")
     739                    .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     740                    .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     741                    .dwattr $C$DW$42, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     742                    .dwattr $C$DW$42, DW_AT_decl_line(0x59)
     743                    .dwattr $C$DW$42, DW_AT_decl_column(0x17)
     744            
     745            $C$DW$43        .dwtag  DW_TAG_member
     746                    .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$12)
     747                    .dwattr $C$DW$43, DW_AT_name("rem")
     748                    .dwattr $C$DW$43, DW_AT_TI_symbol_name("rem")
     749                    .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     750                    .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     751                    .dwattr $C$DW$43, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     752                    .dwattr $C$DW$43, DW_AT_decl_line(0x59)
     753                    .dwattr $C$DW$43, DW_AT_decl_column(0x1d)
     754            
     755                    .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     756                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x59)
     757                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
     758                    .dwendtag $C$DW$T$26
     759            
     760            $C$DW$T$35      .dwtag  DW_TAG_typedef
     761                    .dwattr $C$DW$T$35, DW_AT_name("ldiv_t")
     762                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$26)
     763                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
     764                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     765                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x59)
     766                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x24)
     767            
     768            
     769            $C$DW$T$27      .dwtag  DW_TAG_structure_type
     770                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
     771            $C$DW$44        .dwtag  DW_TAG_member
     772                    .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$14)
     773                    .dwattr $C$DW$44, DW_AT_name("quot")
     774                    .dwattr $C$DW$44, DW_AT_TI_symbol_name("quot")
     775                    .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     776                    .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     777                    .dwattr $C$DW$44, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     778                    .dwattr $C$DW$44, DW_AT_decl_line(0x63)
     779                    .dwattr $C$DW$44, DW_AT_decl_column(0x1c)
     780            
     781            $C$DW$45        .dwtag  DW_TAG_member
     782                    .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$14)
     783                    .dwattr $C$DW$45, DW_AT_name("rem")
     784                    .dwattr $C$DW$45, DW_AT_TI_symbol_name("rem")
     785                    .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     786                    .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     787                    .dwattr $C$DW$45, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     788                    .dwattr $C$DW$45, DW_AT_decl_line(0x63)
     789                    .dwattr $C$DW$45, DW_AT_decl_column(0x22)
     790            
     791                    .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
MSP430 Assembler PC v21.6.1 Mon Feb 24 13:28:08 2025

Copyright (c) 2003-2018 Texas Instruments Incorporated
clk.asm                                                              PAGE   17

     792                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x63)
     793                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
     794                    .dwendtag $C$DW$T$27
     795            
     796            $C$DW$T$36      .dwtag  DW_TAG_typedef
     797                    .dwattr $C$DW$T$36, DW_AT_name("lldiv_t")
     798                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$27)
     799                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
     800                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     801                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x63)
     802                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x29)
     803            
     804            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     805                    .dwattr $C$DW$T$2, DW_AT_name("void")
     806            
     807            
     808            $C$DW$T$37      .dwtag  DW_TAG_subroutine_type
     809                    .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
     810                    .dwendtag $C$DW$T$37
     811            
     812            $C$DW$T$38      .dwtag  DW_TAG_pointer_type
     813                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
     814                    .dwattr $C$DW$T$38, DW_AT_address_class(0x14)
     815            
     816            $C$DW$T$39      .dwtag  DW_TAG_typedef
     817                    .dwattr $C$DW$T$39, DW_AT_name("__TI_atexit_fn")
     818                    .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
     819                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
     820                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     821                    .dwattr $C$DW$T$39, DW_AT_decl_line(0xcf)
     822                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x14)
     823            
     824            
     825            $C$DW$T$41      .dwtag  DW_TAG_subroutine_type
     826                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
     827                    .dwendtag $C$DW$T$41
     828            
     829            $C$DW$T$42      .dwtag  DW_TAG_pointer_type
     830                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
     831                    .dwattr $C$DW$T$42, DW_AT_address_class(0x14)
     832            
     833            $C$DW$T$43      .dwtag  DW_TAG_typedef
     834                    .dwattr $C$DW$T$43, DW_AT_name("__SFR_FARPTR")
     835                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
     836                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
     837                    .dwattr $C$DW$T$43, DW_AT_decl_file("C:\ti\ccs1250\ccs\ccs_base\msp430\include\msp430fg6626.h"
     838                    .dwattr $C$DW$T$43, DW_AT_decl_line(0x46)
     839                    .dwattr $C$DW$T$43, DW_AT_decl_column(0x11)
     840            
     841            $C$DW$46        .dwtag  DW_TAG_TI_far_type
     842                    .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$2)
     843            
     844            $C$DW$T$44      .dwtag  DW_TAG_const_type
